[{"@odata.etag":"","ItemInternalId":"073ba74b-a8c8-4c77-82d6-c67fa949a5be","Organization\nID":"O1","Organization Name":"Albertsons","Character\nID":"C25","Character":"Supermarket","Organization Description":"Albertsons is one of the largest U.S. grocery chains, with ~2,270 stores across 34 states. It offers full-service grocery, pharmacy, fuel, and e-commerce through banners like Safeway and Vons. The company emphasizes private-label products and loyalty programs to drive margins. Annual revenue is approximately $72B with profit around $1.6B.","Comments":""},{"@odata.etag":"","ItemInternalId":"88953f1b-726d-4974-85f6-50e846c9ae6a","Organization\nID":"O2","Organization Name":"American Heart Association","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"Founded in 1924, the AHA leads efforts to combat heart disease and stroke through research, public health campaigns, and training. It has funded over $5 billion in cardiovascular research to date. The association publishes widely used clinical guidelines and advocates for healthy living and public policy. It operates with more than 35 million volunteers and donors nationwide.","Comments":""},{"@odata.etag":"","ItemInternalId":"a325746a-3e3c-4fc8-a44b-fb83b6859e24","Organization\nID":"O3","Organization Name":"Baylor University","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Baylor is a private Baptist-affiliated R1 research university in Waco, TX, established in 1845. It offers over 140 undergraduate and graduate majors, and champions Christian-based education. Enrollment is ~20,000 students, and athletics play a significant role in campus life. The university has a growing footprint in community service and global health research.","Comments":""},{"@odata.etag":"","ItemInternalId":"96a28b04-ab87-40ca-9107-ea9555915e96","Organization\nID":"O4","Organization Name":"Bridge Builders","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Bridge Builders is a Dallas-based nonprofit that mends racial and socioeconomic divides through mentorship, events, and networking. It engages ~200 volunteers annually to support youth, families, and community leaders. The organization operates under Christian principles, providing mediation and development services. Reported revenue is approximately $1.7 million.","Comments":""},{"@odata.etag":"","ItemInternalId":"5c1d6485-2c93-4293-aebd-97a17fe4bed0","Organization\nID":"O5","Organization Name":"Child Poverty Action Lab (CPAL)","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"CPAL is a Dallas-based nonprofit focused on reducing child poverty by 50% by 2040 through evidence-based policy solutions. It works in five key areas: maternal health, public benefits, housing stability, public safety, and early childhood. CPAL partners with local governments and nonprofits to test and scale impactful interventions. Its work is rooted in rigorous data analysis and systems thinking.","Comments":""},{"@odata.etag":"","ItemInternalId":"523872d9-77cb-4bc8-9d96-f626662d968f","Organization\nID":"O6","Organization Name":"City of Dallas","Character\nID":"C12","Character":"Government","Organization Description":"The City of Dallas is the municipal government managing public health, social services, and community initiatives for 1.3 million residents. Agencies under its umbrella include public health, housing, sustainability, and economic development. It oversees city-run food distribution events and nutrition programs. Budget priorities reflect health equity and food access in underserved neighborhoods.","Comments":""},{"@odata.etag":"","ItemInternalId":"0c726ae7-9710-4fb3-9777-006588953509","Organization\nID":"O7","Organization Name":"Community Foundations Texas","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Community Foundations Texas is an association of over 50 community foundations statewide, promoting local philanthropy and leadership. It offers shared resources, advocacy, and capacity-building training. Members award millions in local grants annually across education, health, and civic projects. The network engages donors and nonprofit leaders across Texas.","Comments":""},{"@odata.etag":"","ItemInternalId":"10d02dc7-a594-4eba-8f23-35b2e0845cd4","Organization\nID":"O8","Organization Name":"Community Volunteer","Character\nID":"C13","Character":"Other","Organization Description":"","Comments":""},{"@odata.etag":"","ItemInternalId":"73c0a44b-7d95-4df4-a186-7775a5fec159","Organization\nID":"O9","Organization Name":"Crossroads Community Services","Character\nID":"C28","Character":"Food Bank","Organization Description":"Crossroads Community Services provides food assistance and support services to low-income families in Dallas. It operates a client-choice pantry model and collaborates with social service providers for wraparound support. The organization also engages in research to improve hunger relief methods. It serves tens of thousands of individuals annually through partnerships and direct services.","Comments":""},{"@odata.etag":"","ItemInternalId":"0476f0f8-6687-4a5b-9fb8-2d4d0a88a309","Organization\nID":"O10","Organization Name":"Dallas County","Character\nID":"C12","Character":"Government","Organization Description":"Dallas County governs county-wide services, including health care, criminal justice, and public assistance programs. It administers food access efforts via county clinics, SNAP outreach, and community centers. The county budget supports nutrition education and mobile health units in low-income areas. Population served exceeds 2.6 million residents.","Comments":""},{"@odata.etag":"","ItemInternalId":"8892e15a-01f0-47fc-b76f-d114c1e25fe0","Organization\nID":"O11","Organization Name":"Dallas County Health and Human Services","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"DC HHS is the county’s health department responsible for disease surveillance, healthcare access, and social services. It conducts community clinics, immunizations, and nutrition programs targeting vulnerable populations. The department coordinates with nonprofits to address food insecurity. It also tracks health outcomes and disparities data.","Comments":""},{"@odata.etag":"","ItemInternalId":"43138a4a-5c11-455d-bb27-3f99ffd8ebb9","Organization\nID":"O12","Organization Name":"Dallas Hospital Council","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"The Dallas Hospital Council represents ~35 hospitals and healthcare systems in Dallas County. It coordinates clinical collaborations, emergency preparedness, and community health planning. The group advocates for hospital-related legislation and funding. It also leads data-sharing initiatives and workforce development programs.","Comments":""},{"@odata.etag":"","ItemInternalId":"3fa08648-f979-48f5-b6ff-5655f2f59b2b","Organization\nID":"O13","Organization Name":"Dallas Morning News","Character\nID":"C3","Character":"Communicator","Organization Description":"The Dallas Morning News is one of Texas’s oldest and most influential newspapers, founded in 1885 and serving the DFW metroplex. It provides reporting on local news, policy, health, education, and food access—shaping public opinion and civic dialogue. Through its editorial board and investigative journalism, it holds institutions accountable and highlights equity issues. It also partners with local nonprofits for awareness campaigns and community reporting.","Comments":""},{"@odata.etag":"","ItemInternalId":"8b7c670a-53c6-4c73-8520-f66c5ee23f79","Organization\nID":"O14","Organization Name":"Farm and Ranch Freedom Alliance","Character\nID":"C4","Character":"Legislator","Organization Description":"This Texas-based nonprofit advocates for the rights of small farmers and homesteaders, focusing on fair food policies and local control. It works to protect small producers from overly burdensome regulations. The alliance engages in legislative lobbying, legal advocacy, and grassroots organizing. It also provides resources and alerts to help farmers navigate changing policies.","Comments":""},{"@odata.etag":"","ItemInternalId":"a719b44d-ef21-4bb2-b5b3-f19063dbb8af","Organization\nID":"O15","Organization Name":"Farm Vet","Character\nID":"C13","Character":"Other","Organization Description":"Farm Vet is a veterinary supply company that supports farmers and ranchers with livestock health products and on-farm service referrals. It offers pharmaceuticals, equipment, and animal nutrition solutions tailored for agricultural clients. The company aims to maintain herd health and productivity through preventative care. It also supports education around sustainable animal husbandry practices.","Comments":""},{"@odata.etag":"","ItemInternalId":"7d9d20f0-d2bc-40b4-a593-884baf3350b2","Organization\nID":"O16","Organization Name":"Farmer","Character\nID":"C13","Character":"Other","Organization Description":"","Comments":""},{"@odata.etag":"","ItemInternalId":"2b19a31a-2306-4521-b3bd-74480b8c329b","Organization\nID":"O17","Organization Name":"Green City Growers","Character\nID":"C9","Character":"Urban Agriculture","Organization Description":"Green City Growers is an urban agriculture company specializing in hydroponic and aquaponic farming in reclaimed city spaces. It grows leafy greens and herbs for local retailers, hospitals, and schools. The business emphasizes sustainability and reduced food miles. It also educates communities on closed-loop farming and climate-resilient food systems.","Comments":""},{"@odata.etag":"","ItemInternalId":"3e11b941-73db-437d-bfc1-ce4f8b17bc6f","Organization\nID":"O18","Organization Name":"Groundwork DFW","Character\nID":"C9","Character":"Urban Agriculture","Organization Description":"Groundwork DFW is part of the national Groundwork USA network focused on urban revitalization and environmental justice. In Dallas, it supports green space creation, urban gardens, and youth employment through environmental stewardship. The organization works in underserved neighborhoods to increase access to healthy food and outdoor spaces. Its projects often involve community design, education, and sustainability goals.","Comments":""},{"@odata.etag":"","ItemInternalId":"1d8ddad4-85bf-4949-a253-976b3d4b4997","Organization\nID":"O19","Organization Name":"GROW North Texas","Character\nID":"C11","Character":"Community Food Network","Organization Description":"GROW North Texas connects growers, communities, and organizations to improve food access and equity in North Texas. It runs programs for gleaning, backyard gardening, farm-to-school, and food rescue. The organization supports local farmers while also facilitating emergency food distribution. It also leads educational initiatives around nutrition and food systems.","Comments":""},{"@odata.etag":"","ItemInternalId":"7565ba76-7045-4867-9348-97af3d3e5ba6","Organization\nID":"O20","Organization Name":"HEB","Character\nID":"C25","Character":"Supermarket","Organization Description":"HEB is a major Texas-based supermarket chain renowned for high-quality fresh produce, particularly regional products like Central Market. With over 400 stores, it supports communities through disaster relief, scholarships, and local partnerships. The company is privately owned and consistently ranks well for customer loyalty and employee engagement. It reinvests profits into innovation, including automated distribution centers.","Comments":""},{"@odata.etag":"","ItemInternalId":"5ae10032-aec8-425b-bc36-f34cfbf567fd","Organization\nID":"O21","Organization Name":"Lyda Hill Holdings","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Lyda Hill Holdings is a private investment firm and philanthropic office supporting science, nature, health, and community impact. Based in Dallas, it uses both grants and investments to catalyze innovation in fields like biotech, conservation, and urban resilience. The organization prioritizes evidence-based projects with scalable solutions. It often collaborates with nonprofits, research institutions, and entrepreneurs.","Comments":""},{"@odata.etag":"","ItemInternalId":"01a86928-a299-4204-b764-4adb909d339d","Organization\nID":"O22","Organization Name":"Meadows Foundation","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Meadows Foundation is one of Texas's largest private philanthropies, headquartered in Dallas and focused on improving the quality of life for Texans. It funds initiatives in education, health, public safety, arts, and civic engagement. Since 1948, it has awarded more than $1.5 billion in grants. It also offers nonprofit capacity-building and leadership development programs.","Comments":""},{"@odata.etag":"","ItemInternalId":"a721e4ab-3297-4d47-a437-346dbfd5a61a","Organization\nID":"O23","Organization Name":"Moonshot Compost","Character\nID":"C37","Character":"Composting","Organization Description":"Moonshot Compost is a Dallas-based company that collects food waste from homes, businesses, and institutions to create compost. It helps reduce landfill use and regenerate soil for urban agriculture. The company partners with schools and farms to promote sustainable practices. It also tracks and reports diversion metrics for clients to encourage zero-waste efforts.","Comments":""},{"@odata.etag":"","ItemInternalId":"6abb99c6-19fe-4b64-bcc6-f47da3a8805c","Organization\nID":"O24","Organization Name":"North Texas Food Bank","Character\nID":"C28","Character":"Food Bank","Organization Description":"The North Texas Food Bank (NTFB) is the region’s largest hunger-relief organization, distributing food across 13 counties. It supplies partner pantries, shelters, and soup kitchens with nutritious food and meals. The food bank also runs mobile pantry events and SNAP outreach. It serves over 700,000 people annually and focuses on food equity and health outcomes.","Comments":""},{"@odata.etag":"","ItemInternalId":"0a506e96-a420-4236-816f-be2e51e4532c","Organization\nID":"O25","Organization Name":"Pan Africian Connections","Character\nID":"C13","Character":"Other","Organization Description":"Pan African Connection is a cultural center, bookstore, and event space in South Dallas focused on celebrating African heritage and promoting economic empowerment. It serves as a hub for local Black-owned businesses, community events, and educational programming. The organization connects cultural identity with community development. It frequently hosts food, art, and wellness initiatives with a Pan-African focus.","Comments":""},{"@odata.etag":"","ItemInternalId":"1d6b2197-4a69-4ca0-8759-ed7dbb0f605a","Organization\nID":"O26","Organization Name":"Parkland Health","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"Parkland Health is the county’s primary safety-net hospital system, operating the historic Parkland Memorial Hospital. It delivers trauma care, specialty clinics, and community wellness programs to underserved populations. With over 10,000 employees, it manages outpatient clinics and newborn care. Parkland also provides essential nutrition and social support services within its facilities.","Comments":""},{"@odata.etag":"","ItemInternalId":"c375c5e7-d864-424a-b0c6-54665a0c9e8b","Organization\nID":"O27","Organization Name":"Paul Quinn College","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Paul Quinn is a private HBCU in Dallas known for social justice and community engagement programs. It operates the WE Over Me Farm, integrating student leadership with sustainable agriculture. Enrollment is ~1,300 undergraduates, and emphasis is on urban renewal and workforce development. The college fosters student-run food initiatives and local entrepreneurship.","Comments":""},{"@odata.etag":"","ItemInternalId":"84be0c32-dba5-4e0a-bb23-da5dd24b8092","Organization\nID":"O28","Organization Name":"Restorative Farms","Character\nID":"C9","Character":"Urban Agriculture","Organization Description":"Restorative Farms is an urban agriculture nonprofit focused on creating job pathways and improving health in food-insecure Dallas neighborhoods. It runs a local farm and seedling operation that provides produce and training for young adults and returning citizens. The organization blends farming, entrepreneurship, and education. Produce is sold through CSA boxes and local outlets.","Comments":""},{"@odata.etag":"","ItemInternalId":"50c24ec3-5f12-41c7-852a-4d3ac757a9f5","Organization\nID":"O29","Organization Name":"SMU","Character\nID":"C31","Character":"Educational Institution","Organization Description":"SMU is a private, nonsectarian research university in Dallas with ~12,000 students. It excels in business, law, arts, sciences, and engineering, with over $100 million in annual research expenditures. SMU works closely with Dallas nonprofits on community education and health initiatives. Its Cox School of Business and Meadows School of the Arts are nationally recognized.","Comments":""},{"@odata.etag":"","ItemInternalId":"6480a171-9484-4af4-8219-feff797da0d3","Organization\nID":"O30","Organization Name":"South Dallas Employment Project","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The South Dallas Employment Project is a collaborative initiative aimed at improving employment outcomes in historically underserved neighborhoods. It works with employers, schools, and social service providers to create job pathways. The project emphasizes wraparound supports like childcare, transportation, and housing to help participants maintain employment. It also facilitates skills training and job placement partnerships.","Comments":""},{"@odata.etag":"","ItemInternalId":"60884867-2101-4e73-908f-1f12d5ecd659","Organization\nID":"O31","Organization Name":"Sunwest Communications","Character\nID":"C3","Character":"Communicator","Organization Description":"Sunwest Communications (founded 1982, Dallas, TX) is a strategic public relations and public affairs firm specializing in reputation management, crisis communications, CSR, and digital services. It serves corporate, nonprofit, government, and association clients, delivering campaigns that build visibility, credibility, and audience engagement. With 40+ years of experience and ~11–50 employees, it emphasizes tailored storytelling and media strategy.","Comments":""},{"@odata.etag":"","ItemInternalId":"4ec6af0d-7436-440b-b409-98e6bf85d435","Organization\nID":"O32","Organization Name":"Texas Restaurant Association","Character\nID":"C4","Character":"Legislator","Organization Description":"The Texas Restaurant Association is a nonprofit trade group for restaurant operators statewide. It provides advocacy, training, and advisory services, and monitors legislative/regulatory issues affecting the hospitality industry. Its membership includes thousands of independent and chain operators. Revenue is primarily from dues, event sponsorships, and training programs.","Comments":""},{"@odata.etag":"","ItemInternalId":"35324478-a179-4cf1-b09a-362757d43fd3","Organization\nID":"O33","Organization Name":"United Way","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"United Way is a global nonprofit network that mobilizes communities to advance education, financial stability, and health. United Way of Metropolitan Dallas supports over 200 local partners and initiatives through fundraising, volunteer mobilization, and grantmaking. It leads collective impact programs across North Texas, especially in underserved communities. Its funding model includes workplace giving, corporate partnerships, and foundation support.","Comments":""},{"@odata.etag":"","ItemInternalId":"ad95f1ff-8ceb-4446-8ccc-ec0bb5ca0892","Organization\nID":"O34","Organization Name":"UT Dallas","Character\nID":"C31","Character":"Educational Institution","Organization Description":"UTD is a public R1 university in Richardson, part of the UT system, with ~30,000 students. It’s known for STEM, computer science, and business programs, with strong industry partnerships. The university supports local food system research and community health projects. UTD also hosts labs focused on data-driven urban policy.","Comments":""},{"@odata.etag":"","ItemInternalId":"9585295b-c7a4-42fd-ae6e-30eb538403df","Organization\nID":"O35","Organization Name":"UT Southwestern Medical Center","Character\nID":"C31","Character":"Educational Institution","Organization Description":"UT Southwestern is a leading academic medical center in Dallas, renowned for biomedical research, clinical care, and education. It operates multiple hospitals and outpatient clinics serving the regional population. Ranked among top US institutions for neurology, cardiology, and cancer treatment. The medical center is a center of innovation receiving substantial NIH funding.","Comments":""},{"@odata.etag":"","ItemInternalId":"6fdc0244-3e46-47ba-8649-79ca9b289977","Organization\nID":"O36","Organization Name":"Dallas Food Plan","Character\nID":"C13","Character":"Other","Organization Description":"","Comments":""},{"@odata.etag":"","ItemInternalId":"38449f09-afb7-47d8-b2db-b7e99f02aadf","Organization\nID":"O37","Organization Name":"IBM","Character\nID":"C2","Character":"Technology Partner","Organization Description":"IBM is a global technology and consulting firm that partners with retailers and nonprofits to implement enterprise solutions. It offers services ranging from data analytics and AI to supply chain optimization. IBM works with food banks and governments on digitization and transparency in distribution. Its technologies are used for improving logistics, fundraising analytics, and impact measurement.","Comments":""},{"@odata.etag":"","ItemInternalId":"7305dfcb-d67e-4304-bc21-7af054059018","Organization\nID":"O38","Organization Name":"Faith Commons","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Faith Commons promotes interfaith dialogue and civic engagement among religious communities in North Texas. It hosts panels, workshops, and advocacy campaigns focused on social justice, equity, and compassion. The organization partners with nonprofits and faith leaders to respond to current events and policy debates. It works to bridge ideological divides through shared moral values and public theology.","Comments":""},{"@odata.etag":"","ItemInternalId":"cb1e12ac-b395-4b6d-8c95-0d5068e2a84f","Organization\nID":"O39","Organization Name":"Allyn","Character\nID":"C3","Character":"Communicator","Organization Description":"Allyn Media (founded 1983, Dallas, TX) is a women-owned full-service communications firm specializing in public relations, public affairs, political media, crisis management, and nonprofit development. It supports Fortune 500 companies, government, and grassroots clients with data-driven strategy, creative design, and coalition building. Known for award-winning campaigns in social justice, it blends brand strategy, advertising, and digital content services.","Comments":""},{"@odata.etag":"","ItemInternalId":"2f0e5074-6e02-42ec-a3b8-68fcf345ade7","Organization\nID":"O40","Organization Name":"Timberview Farmstead","Character\nID":"C16","Character":"Community Garden","Organization Description":"Timberview Farmstead is a nonprofit teaching farm in Fort Worth, Texas, built on a former golf course, that provides hands-on farm-based education, culinary experiences, and community programming. The campus includes greenhouses, a pavilion, gardens, and livestock areas, hosting field trips, camps, workshops, memberships, and private events with an emphasis on the themes “learn, grow, belong.” Their mission focuses on empowering young people and families through restorative agriculture, with plans to expand into social enterprises like a farm store, restaurant, health clinic, and agriscience academy.","Comments":""}]