[{"@odata.etag":"","ItemInternalId":"69209276-8060-436f-886b-f6a223ddea2d","Organization\nID":"O1","Organization Name":"Albertsons","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C25","Character":"Supermarket","Organization Description":"Albertsons is one of the largest U.S. grocery chains, with ~2,270 stores across 34 states. It offers full-service grocery, pharmacy, fuel, and e-commerce through banners like Safeway and Vons. The company emphasizes private-label products and loyalty programs to drive margins. Annual revenue is approximately $72B with profit around $1.6B.","Web Link":"https://www.albertsons.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"4591f2ae-5772-431f-bd58-112bf8478184","Organization\nID":"O2","Organization Name":"American Heart Association","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"Founded in 1924, the AHA leads efforts to combat heart disease and stroke through research, public health campaigns, and training. It has funded over $5 billion in cardiovascular research to date. The association publishes widely used clinical guidelines and advocates for healthy living and public policy. It operates with more than 35 million volunteers and donors nationwide.","Web Link":"https://www.heart.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"91b9f589-95c2-40cb-a72f-95fd7b4379ee","Organization\nID":"O3","Organization Name":"Baylor University","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Baylor is a private Baptist-affiliated R1 research university in Waco, TX, established in 1845. It offers over 140 undergraduate and graduate majors, and champions Christian-based education. Enrollment is ~20,000 students, and athletics play a significant role in campus life. The university has a growing footprint in community service and global health research.","Web Link":"https://www.baylor.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"9cb8ec91-98df-44ca-bc32-2d24fbc7857c","Organization\nID":"O4","Organization Name":"Bridge Builders","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Bridge Builders is a Dallas-based nonprofit that mends racial and socioeconomic divides through mentorship, events, and networking. It engages ~200 volunteers annually to support youth, families, and community leaders. The organization operates under Christian principles, providing mediation and development services. Reported revenue is approximately $1.7 million.","Web Link":"https://bridgebuilders.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"3fce0420-bf8d-4e82-a62a-f72c2e3186e4","Organization\nID":"O5","Organization Name":"Child Poverty Action Lab (CPAL)","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"CPAL is a Dallas-based nonprofit focused on reducing child poverty by 50% by 2040 through evidence-based policy solutions. It works in five key areas: maternal health, public benefits, housing stability, public safety, and early childhood. CPAL partners with local governments and nonprofits to test and scale impactful interventions. Its work is rooted in rigorous data analysis and systems thinking.","Web Link":"https://childpovertyactionlab.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"43569e64-1adf-4f66-92bd-40ed8496a8dd","Organization\nID":"O6","Organization Name":"City of Dallas","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C12","Character":"Government","Organization Description":"The City of Dallas is the municipal government managing public health, social services, and community initiatives for 1.3 million residents. Agencies under its umbrella include public health, housing, sustainability, and economic development. It oversees city-run food distribution events and nutrition programs. Budget priorities reflect health equity and food access in underserved neighborhoods.","Web Link":"https://dallascityhall.com/Pages/default.aspx","Comments":""},{"@odata.etag":"","ItemInternalId":"b8a5d625-aaed-4529-828e-bfabe0a0b643","Organization\nID":"O7","Organization Name":"Community Foundations of Texas","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Community Foundations Texas is an association of over 50 community foundations statewide, promoting local philanthropy and leadership. It offers shared resources, advocacy, and capacity-building training. Members award millions in local grants annually across education, health, and civic projects. The network engages donors and nonprofit leaders across Texas.","Web Link":"https://www.cftexas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"00dd299b-fcd8-43d9-ad32-c36a00be966c","Organization\nID":"O8","Organization Name":"Community Volunteer","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C13","Character":"Other","Organization Description":" -","Web Link":"- ","Comments":""},{"@odata.etag":"","ItemInternalId":"b35747dd-77f8-424e-a6f9-b29f362515cc","Organization\nID":"O9","Organization Name":"Crossroads Community Services","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C28","Character":"Food Bank","Organization Description":"Crossroads Community Services provides food assistance and support services to low-income families in Dallas. It operates a client-choice pantry model and collaborates with social service providers for wraparound support. The organization also engages in research to improve hunger relief methods. It serves tens of thousands of individuals annually through partnerships and direct services.","Web Link":"https://ccsdallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"d3d0c528-44d3-4981-84b9-b0a85e8653b1","Organization\nID":"O10","Organization Name":"Dallas County","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C12","Character":"Government","Organization Description":"Dallas County governs county-wide services, including health care, criminal justice, and public assistance programs. It administers food access efforts via county clinics, SNAP outreach, and community centers. The county budget supports nutrition education and mobile health units in low-income areas. Population served exceeds 2.6 million residents.","Web Link":"https://www.dallascounty.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"dc9583c7-17d6-46af-9ad3-c3a5b8451ffb","Organization\nID":"O11","Organization Name":"Dallas County Health and Human Services","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"DC HHS is the county’s health department responsible for disease surveillance, healthcare access, and social services. It conducts community clinics, immunizations, and nutrition programs targeting vulnerable populations. The department coordinates with nonprofits to address food insecurity. It also tracks health outcomes and disparities data.","Web Link":"https://www.dallascounty.org/departments/dchhs/","Comments":""},{"@odata.etag":"","ItemInternalId":"2942468d-6636-4fd3-ba89-0deba8b07a80","Organization\nID":"O12","Organization Name":"Dallas-Fort Worth Hospital Council","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"The Dallas Hospital Council represents ~35 hospitals and healthcare systems in Dallas County. It coordinates clinical collaborations, emergency preparedness, and community health planning. The group advocates for hospital-related legislation and funding. It also leads data-sharing initiatives and workforce development programs.","Web Link":"https://dfwhc.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"2827fea4-9ee7-4d2f-81f5-4267a21b5a69","Organization\nID":"O13","Organization Name":"Dallas Morning News","Pillar\nID":"P9","Pillar":"Communicator","Character\nID":"C3","Character":"Communicator","Organization Description":"The Dallas Morning News is one of Texas’s oldest and most influential newspapers, founded in 1885 and serving the DFW metroplex. It provides reporting on local news, policy, health, education, and food access—shaping public opinion and civic dialogue. Through its editorial board and investigative journalism, it holds institutions accountable and highlights equity issues. It also partners with local nonprofits for awareness campaigns and community reporting.","Web Link":"https://www.dallasnews.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"8ae84a80-007b-4923-9d6e-5d4c51ad4183","Organization\nID":"O14","Organization Name":"Farm and Ranch Freedom Alliance","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C4","Character":"Legislator","Organization Description":"This Texas-based nonprofit advocates for the rights of small farmers and homesteaders, focusing on fair food policies and local control. It works to protect small producers from overly burdensome regulations. The alliance engages in legislative lobbying, legal advocacy, and grassroots organizing. It also provides resources and alerts to help farmers navigate changing policies.","Web Link":"https://farmandranchfreedom.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"e80e9a1a-87ff-438b-b7e7-fc603167047a","Organization\nID":"O15","Organization Name":"Farm Vet","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C13","Character":"Other","Organization Description":"Farm Vet is a veterinary supply company that supports farmers and ranchers with livestock health products and on-farm service referrals. It offers pharmaceuticals, equipment, and animal nutrition solutions tailored for agricultural clients. The company aims to maintain herd health and productivity through preventative care. It also supports education around sustainable animal husbandry practices.","Web Link":"https://www.farmvet.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"6e43c2bd-5a96-4846-8a77-40b9a9754fcd","Organization\nID":"O16","Organization Name":"Farmer","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C13","Character":"Other","Organization Description":"-","Web Link":"- ","Comments":""},{"@odata.etag":"","ItemInternalId":"95e2a360-bd82-45b8-bb06-b102acc02bb5","Organization\nID":"O17","Organization Name":"Green City Growers","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"Green City Growers is an urban agriculture company specializing in hydroponic and aquaponic farming in reclaimed city spaces. It grows leafy greens and herbs for local retailers, hospitals, and schools. The business emphasizes sustainability and reduced food miles. It also educates communities on closed-loop farming and climate-resilient food systems.","Web Link":"https://greencitygrowers.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"1badea5a-98e8-42a5-a61c-2efa9b74f155","Organization\nID":"O18","Organization Name":"Groundwork DFW","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"Groundwork DFW is part of the national Groundwork USA network focused on urban revitalization and environmental justice. In Dallas, it supports green space creation, urban gardens, and youth employment through environmental stewardship. The organization works in underserved neighborhoods to increase access to healthy food and outdoor spaces. Its projects often involve community design, education, and sustainability goals.","Web Link":"https://www.groundworkoutreach.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"fea285c4-a885-4a11-8132-dc3a2833a801","Organization\nID":"O19","Organization Name":"GROW North Texas","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C11","Character":"Community Food Network","Organization Description":"GROW North Texas connects growers, communities, and organizations to improve food access and equity in North Texas. It runs programs for gleaning, backyard gardening, farm-to-school, and food rescue. The organization supports local farmers while also facilitating emergency food distribution. It also leads educational initiatives around nutrition and food systems.","Web Link":"https://grownorthtexas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"1fe2629d-ca3d-49e9-9b99-3be85902a4b9","Organization\nID":"O20","Organization Name":"H-E-B","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C25","Character":"Supermarket","Organization Description":"HEB is a major Texas-based supermarket chain renowned for high-quality fresh produce, particularly regional products like Central Market. With over 400 stores, it supports communities through disaster relief, scholarships, and local partnerships. The company is privately owned and consistently ranks well for customer loyalty and employee engagement. It reinvests profits into innovation, including automated distribution centers.","Web Link":"https://www.heb.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"8873de86-d761-4a90-a6a8-e3e3af59888b","Organization\nID":"O21","Organization Name":"Lyda Hill Holdings","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Lyda Hill Holdings is a private investment firm and philanthropic office supporting science, nature, health, and community impact. Based in Dallas, it uses both grants and investments to catalyze innovation in fields like biotech, conservation, and urban resilience. The organization prioritizes evidence-based projects with scalable solutions. It often collaborates with nonprofits, research institutions, and entrepreneurs.","Web Link":"https://www.lydahillphilanthropies.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"7bc7eebc-79fb-44d0-8147-56759b1f6bc5","Organization\nID":"O22","Organization Name":"Meadows Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Meadows Foundation is one of Texas's largest private philanthropies, headquartered in Dallas and focused on improving the quality of life for Texans. It funds initiatives in education, health, public safety, arts, and civic engagement. Since 1948, it has awarded more than $1.5 billion in grants. It also offers nonprofit capacity-building and leadership development programs.","Web Link":"https://www.mfi.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"04ee46b2-5ceb-46b3-b4d0-720865cd5c51","Organization\nID":"O23","Organization Name":"Moonshot Compost","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C36","Character":"Waste Transporter","Organization Description":"Moonshot Compost is a Dallas-based company that collects food waste from homes, businesses, and institutions, finally delivering it to composting facilities to create compost. It helps reduce landfill use and regenerate soil for urban agriculture. The company partners with schools and farms to promote sustainable practices. It also tracks and reports diversion metrics for clients to encourage zero-waste efforts.","Web Link":"https://www.moonshotcompost.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"ba2afc5f-0278-4fe6-893e-ff146c41904d","Organization\nID":"O24","Organization Name":"North Texas Food Bank","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C28","Character":"Food Bank","Organization Description":"The North Texas Food Bank (NTFB) is the region’s largest hunger-relief organization, distributing food across 13 counties. It supplies partner pantries, shelters, and soup kitchens with nutritious food and meals. The food bank also runs mobile pantry events and SNAP outreach. It serves over 700,000 people annually and focuses on food equity and health outcomes.","Web Link":"https://ntfb.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"5022ad33-cf91-4a61-b26b-f67e0c5bb695","Organization\nID":"O25","Organization Name":"Pan Africian Connection","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C13","Character":"Other","Organization Description":"Pan African Connection is a cultural center, bookstore, and event space in South Dallas focused on celebrating African heritage and promoting economic empowerment. It serves as a hub for local Black-owned businesses, community events, and educational programming. The organization connects cultural identity with community development. It frequently hosts food, art, and wellness initiatives with a Pan-African focus.","Web Link":"https://panafricanconnection.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"eaa6fe32-ebc3-4018-9e47-cfcc25808551","Organization\nID":"O26","Organization Name":"Parkland Health","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"Parkland Health is the county’s primary safety-net hospital system, operating the historic Parkland Memorial Hospital. It delivers trauma care, specialty clinics, and community wellness programs to underserved populations. With over 10,000 employees, it manages outpatient clinics and newborn care. Parkland also provides essential nutrition and social support services within its facilities.","Web Link":"https://www.parklandhealth.org/home","Comments":""},{"@odata.etag":"","ItemInternalId":"8dc845c5-6bc3-48d9-a211-4b3b07f9c054","Organization\nID":"O27","Organization Name":"Paul Quinn College","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Paul Quinn is a private HBCU in Dallas known for social justice and community engagement programs. It operates the WE Over Me Farm, integrating student leadership with sustainable agriculture. Enrollment is ~1,300 undergraduates, and emphasis is on urban renewal and workforce development. The college fosters student-run food initiatives and local entrepreneurship.","Web Link":"https://paulquinn.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"689b8b86-85d0-4b24-aa56-929df73732ce","Organization\nID":"O28","Organization Name":"Restorative Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"Restorative Farms is an urban agriculture nonprofit focused on creating job pathways and improving health in food-insecure Dallas neighborhoods. It runs a local farm and seedling operation that provides produce and training for young adults and returning citizens. The organization blends farming, entrepreneurship, and education. Produce is sold through CSA boxes and local outlets.","Web Link":"https://www.restorativefarms.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"a4938a78-e6df-4061-8c3c-ceefe03bf5c0","Organization\nID":"O29","Organization Name":"SMU","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"SMU is a private, nonsectarian research university in Dallas with ~12,000 students. It excels in business, law, arts, sciences, and engineering, with over $100 million in annual research expenditures. SMU works closely with Dallas nonprofits on community education and health initiatives. Its Cox School of Business and Meadows School of the Arts are nationally recognized.","Web Link":"https://www.smu.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"32c481d3-79a6-4de8-a7a2-f99aa2c4469a","Organization\nID":"O30","Organization Name":"South Dallas Employment Project","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The South Dallas Employment Project is a collaborative initiative aimed at improving employment outcomes in historically underserved neighborhoods. It works with employers, schools, and social service providers to create job pathways. The project emphasizes wraparound supports like childcare, transportation, and housing to help participants maintain employment. It also facilitates skills training and job placement partnerships.","Web Link":"https://www.southdallasemploymentproject.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"baf5d7bd-41f1-4380-9c7c-afdcc58e5e23","Organization\nID":"O31","Organization Name":"Sunwest Communications","Pillar\nID":"P9","Pillar":"Communicator","Character\nID":"C3","Character":"Communicator","Organization Description":"Sunwest Communications (founded 1982, Dallas, TX) is a strategic public relations and public affairs firm specializing in reputation management, crisis communications, CSR, and digital services. It serves corporate, nonprofit, government, and association clients, delivering campaigns that build visibility, credibility, and audience engagement. With 40+ years of experience and ~11–50 employees, it emphasizes tailored storytelling and media strategy.","Web Link":"https://sunwestpr.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"44123d1d-0496-40c9-9948-489aa2ebe77e","Organization\nID":"O32","Organization Name":"Texas Restaurant Association","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C4","Character":"Legislator","Organization Description":"The Texas Restaurant Association is a nonprofit trade group for restaurant operators statewide. It provides advocacy, training, and advisory services, and monitors legislative/regulatory issues affecting the hospitality industry. Its membership includes thousands of independent and chain operators. Revenue is primarily from dues, event sponsorships, and training programs.","Web Link":"https://www.txrestaurant.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"c9fbfce0-70fe-4e9c-aec0-18e92d1612b3","Organization\nID":"O33","Organization Name":"United Way of Dallas","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"United Way is a global nonprofit network that mobilizes communities to advance education, financial stability, and health. United Way of Metropolitan Dallas supports over 200 local partners and initiatives through fundraising, volunteer mobilization, and grantmaking. It leads collective impact programs across North Texas, especially in underserved communities. Its funding model includes workplace giving, corporate partnerships, and foundation support.","Web Link":"https://unitedwaydallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"eaff5628-bdf0-4907-9d77-48de99d6a4b4","Organization\nID":"O34","Organization Name":"UT Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"UTD is a public R1 university in Richardson, part of the UT system, with ~30,000 students. It’s known for STEM, computer science, and business programs, with strong industry partnerships. The university supports local food system research and community health projects. UTD also hosts labs focused on data-driven urban policy.","Web Link":"https://www.utdallas.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"9546cd47-7f37-49d1-9654-925d33991f2f","Organization\nID":"O35","Organization Name":"UT Southwestern Medical Center","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"UT Southwestern is a leading academic medical center in Dallas, renowned for biomedical research, clinical care, and education. It operates multiple hospitals and outpatient clinics serving the regional population. Ranked among top US institutions for neurology, cardiology, and cancer treatment. The medical center is a center of innovation receiving substantial NIH funding.","Web Link":"https://utswmed.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"77576d0d-0a3b-40f5-a32b-58d635a6deae","Organization\nID":"O36","Organization Name":"Dallas Food Plan","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C13","Character":"Other","Organization Description":"-","Web Link":"https://dallasfoodplan.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"145bb809-0859-4c24-8ca9-1eee2049cfe7","Organization\nID":"O37","Organization Name":"IBM","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C2","Character":"Technology Partner","Organization Description":"IBM is a global technology and consulting firm that partners with retailers and nonprofits to implement enterprise solutions. It offers services ranging from data analytics and AI to supply chain optimization. IBM works with food banks and governments on digitization and transparency in distribution. Its technologies are used for improving logistics, fundraising analytics, and impact measurement.","Web Link":"https://www.ibm.com/us-en","Comments":""},{"@odata.etag":"","ItemInternalId":"f3d4f863-73a5-424f-93e0-3346717e21b1","Organization\nID":"O38","Organization Name":"Faith Commons","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Faith Commons promotes interfaith dialogue and civic engagement among religious communities in North Texas. It hosts panels, workshops, and advocacy campaigns focused on social justice, equity, and compassion. The organization partners with nonprofits and faith leaders to respond to current events and policy debates. It works to bridge ideological divides through shared moral values and public theology.","Web Link":"https://faithcommons.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"6dc22b89-d45e-4e6f-b742-a5d7eae76c82","Organization\nID":"O39","Organization Name":"Allyn","Pillar\nID":"P9","Pillar":"Communicator","Character\nID":"C3","Character":"Communicator","Organization Description":"Allyn Media (founded 1983, Dallas, TX) is a women-owned full-service communications firm specializing in public relations, public affairs, political media, crisis management, and nonprofit development. It supports Fortune 500 companies, government, and grassroots clients with data-driven strategy, creative design, and coalition building. Known for award-winning campaigns in social justice, it blends brand strategy, advertising, and digital content services.","Web Link":"https://allynmedia.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"43264444-00f5-415e-961f-bec8aa70f2f1","Organization\nID":"O40","Organization Name":"Timberview Farmstead","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C16","Character":"Community Garden","Organization Description":"Timberview Farmstead is a nonprofit teaching farm in Fort Worth, Texas, built on a former golf course, that provides hands-on farm-based education, culinary experiences, and community programming. The campus includes greenhouses, a pavilion, gardens, and livestock areas, hosting field trips, camps, workshops, memberships, and private events with an emphasis on the themes “learn, grow, belong.” Their mission focuses on empowering young people and families through restorative agriculture, with plans to expand into social enterprises like a farm store, restaurant, health clinic, and agriscience academy.","Web Link":"https://timberviewfarmstead.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"0bbd448b-af8b-4f9c-a167-66adb959704e","Organization\nID":"O43","Organization Name":"Dallas College Urban Agriculture Program","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"The Dallas College program teaches urban agriculture techniques like hydroponics and habitat conservation to students and the broader community.","Web Link":"https://www.dallascollege.edu/study/agriculture/","Comments":""},{"@odata.etag":"","ItemInternalId":"140f4c94-d597-446c-8320-b8b30a52cb7c","Organization\nID":"O44","Organization Name":"City of Dallas Sanitation Services","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C10","Character":"Waste Managers","Organization Description":"City of Dallas Sanitation Services handles residential waste collection recycling and roll-cart services citywide.","Web Link":"https://dallascityhall.com/departments/sanitation/Pages/default.aspx","Comments":""},{"@odata.etag":"","ItemInternalId":"0df63935-6d02-4fe3-952b-e0c3bc8b1365","Organization\nID":"O45","Organization Name":"Community Waste Disposal","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C10","Character":"Waste Managers","Organization Description":"Community Waste Disposal operates North Texas residential and commercial trash and recycling hauling with eco-friendly CNG trucks.","Web Link":"https://www.communitywastedisposal.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"e1677f39-deee-45bc-a287-83118638de54","Organization\nID":"O46","Organization Name":"Republic Services Dallas","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C10","Character":"Waste Managers","Organization Description":"Republic Services provides scheduled residential and commercial waste pickup recycling dumpster rentals and landfill management around Dallas.","Web Link":"https://www.republicservices.com/locations/texas/dallas-trash-pickup-and-recycling","Comments":""},{"@odata.etag":"","ItemInternalId":"b959fc5f-908d-4a86-acba-04aa6dbcabcb","Organization\nID":"O49","Organization Name":"South Dallas Community Food Center","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C11","Character":"Community Food Network","Organization Description":"This center delivers weekly groceries and hot meals to low-income families in South Dallas.","Web Link":"https://www.smwright.org/our-programs/south-dallas-community-food-center/","Comments":""},{"@odata.etag":"","ItemInternalId":"a1116691-bca6-4d40-b7dc-0e148b2ce32b","Organization\nID":"O52","Organization Name":"Oak Cliff Veggie Project","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C14","Character":"Small Farm","Organization Description":"Oak Cliff Veggie Project grows fresh produce and educates residents on cultivation and cooking in South Dallas.","Web Link":"https://www.oakcliffveggieproject.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"187a8e15-3939-4420-89a3-4546a29d266a","Organization\nID":"O53","Organization Name":"USDA Urban Service Center","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C15","Character":"Institutional Farm ","Organization Description":"USDA’s Dallas Urban Service Center supports urban farmers with loans technical assistance and conservation programs.","Web Link":"https://www.farmers.gov/your-business/urban-growers/urban-service-centers","Comments":""},{"@odata.etag":"","ItemInternalId":"fb5f8c91-bec1-4277-9a89-5edce888aa5f","Organization\nID":"O58","Organization Name":"Lavon Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C17","Character":"Commercial Farm","Organization Description":"Lavon Farms supplies fresh seasonal produce to local markets and restaurants via conventional farming in the region. Operates out of Plano, TX.","Web Link":"http://www.lavonfarms.com/index.php","Comments":""},{"@odata.etag":"","ItemInternalId":"b6e3c1f2-844a-41e1-aa6f-3f0b73f8fce8","Organization\nID":"O59","Organization Name":"Jacob’s Reward Farm","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C17","Character":"Commercial Farm","Organization Description":"Jacob’s Reward Farm produces a variety of fruits and vegetables sold at Dallas-area farmers markets and grocery outlets.","Web Link":"https://the-giving-garden.org/our-impact-jacobs-reward-farm-texas","Comments":""},{"@odata.etag":"","ItemInternalId":"d45d5013-5001-4453-9c41-ce2af77d4ae5","Organization\nID":"O60","Organization Name":"Lucky Layla Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C17","Character":"Commercial Farm","Organization Description":"Lucky Layla Farms grows mixed seasonal vegetables for sale to markets restaurants and wholesalers in North Texas.","Web Link":"https://luckylayla.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"376f8286-5cfe-4761-8921-f00905215744","Organization\nID":"O61","Organization Name":"Oba Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C18","Character":"Lifestock / Poultry Farm","Organization Description":"Oba Farms offers whole goats lambs pasture chickens and beef for home slaughter and delivery around Dallas.","Web Link":"https://www.obafarms.net/","Comments":""},{"@odata.etag":"","ItemInternalId":"7035eca7-46cb-4479-9e77-df48063c981d","Organization\nID":"O62","Organization Name":"Stout Creek Farm","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C18","Character":"Lifestock / Poultry Farm","Organization Description":"Stout Creek Farm raises grass‑fed beef pasture‑raised poultry lamb pork and eggs for sale at local farmers markets. Operates out of Hopkins County.","Web Link":"https://www.stoutcreekfarm.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"bbc6e3dd-fe22-4717-bf19-2c74b418f9db","Organization\nID":"O63","Organization Name":"JBar Cattle","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C18","Character":"Lifestock / Poultry Farm","Organization Description":"JBar Cattle is a family‑owned ranch supplying grass‑fed beef to the Dallas–Houston region.","Web Link":"https://www.jbarcattle.com/?srsltid=AfmBOopdkd4j19Y5egTVeoDY13LHBIwq9KB7kZLrH55_EroW7V9xXVoT","Comments":""},{"@odata.etag":"","ItemInternalId":"f18c1443-b878-4de9-8f7b-579442550ff2","Organization\nID":"O64","Organization Name":"Society Bakery","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C19","Character":"Bakery","Organization Description":"Society Bakery & Tea Room produces scratch‑made cupcakes cakes and pastries and hosts afternoon tea in Dallas.","Web Link":"https://www.societybakery.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"a30e51f8-ae0c-4078-ac49-ab1dcc757edd","Organization\nID":"O65","Organization Name":"Cake Bar","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C19","Character":"Bakery","Organization Description":"Cake Bar Dallas crafts southern-style scratch cakes pound cakes cookies and quick breads from its brick‑and‑mortar shop.","Web Link":"https://cakebardallas.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"6788fe77-88a8-4562-8d9a-0a52b7caff04","Organization\nID":"O66","Organization Name":"Lubellas Patisserie","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C19","Character":"Bakery","Organization Description":"Lubellas Patisserie is an East Dallas handcrafted bakery offering cakes tarts macarons quiches and artisan breads.","Web Link":"https://lubellaspatisserie.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"da74f095-9fd9-4493-99b6-13dea6634162","Organization\nID":"O74","Organization Name":"Texas Best Proteins","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C22","Character":"Processing Plant","Organization Description":"Texas Best Proteins operates a 25,000-square-foot, BRC-certified cook plant in Santo, Texas, producing USDA- and FDA-inspected soups, sauces, entrées, and sides for restaurants, foodservice, and co-packing clients. The company develops both proprietary and private-label products under multiple brands, specializing in safe, consistent, boil-in-bag, fully cooked foods. Its operations emphasize food safety, quality control, and efficiency through advanced production technology and continuous improvement.","Web Link":"https://texasbestproteins.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"b483ce15-c080-4bec-93af-3647a90dc450","Organization\nID":"O79","Organization Name":"Tom Thumb","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Tom Thumb is a regional grocery chain offering a wide selection of fresh produce deli bakery and household essentials.","Web Link":"https://www.tomthumb.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"0055c1eb-03ba-4b1e-8540-08be45366027","Organization\nID":"O80","Organization Name":"Fiesta Mart","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Fiesta Mart is a multicultural supermarket chain specializing in Hispanic and international foods produce and meat.","Web Link":"https://www.fiestamart.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"04a1f4f4-291f-4a7d-9a49-dacb1c8aa9ad","Organization\nID":"O81","Organization Name":"Trader Joe’s","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Trader Joe’s offers a curated grocery shopping experience with unique private label goods and fresh produce.","Web Link":"https://www.traderjoes.com/home","Comments":""},{"@odata.etag":"","ItemInternalId":"ced1abf5-27f5-48fa-bd63-94ab411becc0","Organization\nID":"O82","Organization Name":"Kroger","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C25","Character":"Supermarket","Organization Description":"Kroger operates large-format supermarkets in Dallas with full-service deli pharmacy and extensive produce and meat aisles.","Web Link":"https://www.kroger.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"aac48946-c33b-4f63-9528-8f991cb5fd42","Organization\nID":"O84","Organization Name":"Walmart Supercenter","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C25","Character":"Supermarket","Organization Description":"Walmart Supercenter carries groceries alongside general merchandise electronics and home goods under one roof.","Web Link":"https://www.walmart.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"cbbd1a60-f014-42c5-ab77-62d4eca7a31a","Organization\nID":"O85","Organization Name":"Costco","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C26","Character":"Club-based Store","Organization Description":"Costco offers bulk groceries fresh produce and household items to members at their Dallas warehouse locations.","Web Link":"https://www.costco.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"6d9a94c4-ed9c-4097-8262-b3284bbf9974","Organization\nID":"O86","Organization Name":"Sam’s Club","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C26","Character":"Club-based Store","Organization Description":"Sam’s Club serves Dallas-area shoppers with wholesale bulk food produce meat and prepared meals for members.","Web Link":"https://www.samsclub.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"1be819e7-9ddc-420e-b0f8-6da0447fb24c","Organization\nID":"O87","Organization Name":"BJ’s Wholesale Club","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C26","Character":"Club-based Store","Organization Description":"BJ’s Wholesale Club supplies bulk groceries for members including fresh meats dairy and pantry staples.","Web Link":"https://www.bjs.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"1271117d-d5b6-48fe-814b-c7fc8af65b01","Organization\nID":"O88","Organization Name":"7-Eleven","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C27","Character":"Convenience Store","Organization Description":"7-Eleven operates Dallas-area convenience stores with grab‑and‑go snacks beverages and quick supermarket essentials.","Web Link":"https://www.7-eleven.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"cd09d252-0171-4825-acc2-543912fa3bce","Organization\nID":"O89","Organization Name":"Circle K","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C27","Character":"Convenience Store","Organization Description":"Circle K stocks fuel snacks beverages and ready‑to‑eat items at many Dallas metro locations.","Web Link":"https://www.circlek.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"ef0cc2b3-4e11-4de4-b034-3fcb82415da8","Organization\nID":"O90","Organization Name":"RaceTrac","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C27","Character":"Convenience Store","Organization Description":"RaceTrac includes a wide range of grab‑and‑go foods and beverages alongside fuel services in Dallas-area stations.","Web Link":"https://www.racetrac.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"42cbbd38-bf46-4f94-925e-a4bfae2f36b9","Organization\nID":"O91","Organization Name":"Metrocrest Social Services","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C28","Character":"Food Bank","Organization Description":"Metrocrest Services is a nonprofit based in Carrollton that provides crisis and stability assistance to individuals, families, and seniors in the northwest Dallas County area. Its core programs include a client-choice food pantry, housing and rent assistance, financial education, workforce development, senior transportation and wellness services, and a teaching garden. The organization’s goal is to prevent homelessness, reduce hunger, and help clients achieve long-term self-sufficiency.","Web Link":"https://metrocrestservices.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"be4cc2a8-63ff-4612-8c7b-7fd20b9a1d0c","Organization\nID":"O92","Organization Name":"Harvest House Dallas","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C28","Character":"Food Bank","Organization Description":"Harvest House is Denton’s largest all-in-one live music venue, bar, and beer garden located just east of the Downtown Denton Square. It serves a wide variety of draft beers, cocktails, coffee, kombucha, and fresh juices, with a large patio featuring fire pits, yard games, and regular live performances from local and touring artists. The venue also hosts Collie’s Kitchen food truck and community events, offering a relaxed, inclusive gathering space for locals and visitors alike.","Web Link":"https://www.dentonharvesthouse.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"eaac6875-aa0c-40ea-b17b-b18c3ebd87a2","Organization\nID":"O93","Organization Name":"Sysco","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C29","Character":"Wholesaler","Organization Description":"Sysco supplies foodservice wholesalers and retailers in Dallas with broad-line food and kitchen supplies.","Web Link":"https://www.sysco.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"44c80893-d1a2-4415-afcb-d6d530300d9b","Organization\nID":"O94","Organization Name":"US Foods","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C29","Character":"Wholesaler","Organization Description":"US Foods delivers food products kitchen equipment and supplies to Dallas-area restaurants and institutional customers.","Web Link":"https://www.usfoods.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"8ce87385-847c-4c72-afc3-29d285185d98","Organization\nID":"O95","Organization Name":"Performance Foodservice","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C29","Character":"Wholesaler","Organization Description":"Performance Foodservice distributes food and related products to restaurants schools and care facilities in North Texas.","Web Link":"https://www.performancefoodservice.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"b08e1ca7-8d3f-43d5-8972-bc80ee200aed","Organization\nID":"O96","Organization Name":"Pecan Lodge","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Pecan Lodge is a famed BBQ joint in Dallas known for Texas-style brisket ribs and southern comfort sides.","Web Link":"https://pecanlodge.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"d5a179c6-6a74-456e-b37c-ae759453936b","Organization\nID":"O97","Organization Name":"Uchi","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Uchi offers high-end Japanese sushi and modern Asian cuisine in Dallas’s Uptown neighborhood.","Web Link":"https://uchi.uchirestaurants.com/location/sushi-dallas/","Comments":""},{"@odata.etag":"","ItemInternalId":"8c275507-9aa6-4a99-8448-8bb65e61245f","Organization\nID":"O98","Organization Name":"Mi Cocina","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Mi Cocina is a Dallas-based Tex-Mex chain serving classic regional favorites with a contemporary twist.","Web Link":"https://www.micocina.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"43deea1b-dd56-4b54-857f-606883ea940e","Organization\nID":"O101","Organization Name":"Dallas College","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Dallas College offers associate degrees technical training and urban agriculture education across multiple Dallas campuses.","Web Link":"https://www.dallascollege.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"3ea04980-7b95-42d9-90de-d4277c472a89","Organization\nID":"O108","Organization Name":"Vickery Meadow Food Pantry","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"The Vickery Meadow Food Pantry and Clothes Closet provides free food, clothing, and referral services to residents of Dallas ZIP codes 75231, 75230, 75243, and 75238. Open three days per week, it offers a welcoming environment where families can receive weekly groceries and quarterly clothing support, along with connections to rent, medical, and social service resources. The organization’s mission is to help neighbors care for their families with dignity and compassion.","Web Link":"https://vickerymeadowna.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"a0751f14-b30e-4451-8d81-2ca7ac212323","Organization\nID":"O109","Organization Name":"Frisco Food Pantry","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"The Frisco Family Services Market is a client-choice food pantry that allows Frisco residents facing food insecurity to shop in a grocery store-like setting for nutritious food, hygiene, and household items. It also operates Market Express, an online shopping and curbside pickup option, and a Mobile Market for seniors and individuals lacking transportation. These services ensure equitable food access and preserve client dignity while addressing rising local hunger needs.","Web Link":"https://friscofamilyservices.org/what_we_do/ffsmarket/market.html","Comments":""},{"@odata.etag":"","ItemInternalId":"dd9f7e49-d97e-4162-b93e-6bf30bf22221","Organization\nID":"O110","Organization Name":"Irving Cares","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"The Irving Cares Food Pantry provides nutritious groceries to Irving residents facing food insecurity, supplying each household with three meals per day for a week. Clients are served on a first-come, first-served basis and may visit up to 12 times per service year. The pantry emphasizes equitable access and community dignity, operating alongside Irving Cares’ broader network of emergency assistance, employment, and education programs.","Web Link":"https://irvingcares.org/services/food-pantry/","Comments":""},{"@odata.etag":"","ItemInternalId":"0cd55695-01d6-4a46-a17d-008e58753dd5","Organization\nID":"O111","Organization Name":"Texas Health Harris Methodist Hospital","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Texas Health operates acute care hospitals and health services across Dallas with community outreach and wellness programs.","Web Link":"https://www.texashealth.org/Locations/texas-health-fort-worth","Comments":""},{"@odata.etag":"","ItemInternalId":"1c8c757e-f59d-490d-b4e1-e4a7c77f2253","Organization\nID":"O112","Organization Name":"JPMorgan Chase – Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"JPMorgan Chase’s Dallas headquarters offers banking services corporate philanthropy and financial literacy initiatives.","Web Link":"https://privatebank.jpmorgan.com/nam/en/locations/united-states/texas/dallas","Comments":""},{"@odata.etag":"","ItemInternalId":"a99021f8-a44e-475c-8e62-aaf4bfe2b332","Organization\nID":"O113","Organization Name":"USPS Processing & Distribution Center","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"USPS Dallas center processes and distributes mail and packages supporting regional logistics and postal services.","Web Link":"https://tools.usps.com/locations/details/1436059","Comments":""},{"@odata.etag":"","ItemInternalId":"e2b5850b-f2a9-4085-942c-9a5f94ee2dd7","Organization\nID":"O114","Organization Name":"Waste Management","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C36","Character":"Waste Transporter","Organization Description":"Waste Management Inc. operates trash and recycling collection fleets servicing Dallas residences and businesses.","Web Link":"https://www.wm.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"eab9d53a-771c-475b-aba0-96178b66fa88","Organization\nID":"O120","Organization Name":"White Rock Center for Hope","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"White Rock Center of Hope runs a robust food pantry that distributes roughly 275,000–440,000 pounds of groceries annually to around 500 low-income East Dallas families each month, helping stave off hunger and food insecurity. They offer service by appointment across five zip codes and lean on a volunteer-powered model—including neighborhood food drives and twice-monthly drive‑through distributions—to meet this critical need.","Web Link":"https://whiterockcenterofhope.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"38372f1c-40a9-4ee4-9f2e-501298c78fc7","Organization\nID":"O121","Organization Name":"Food Basket","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"A Black-owned grocery store in South Dallas, originally Save U More, now operating as Food Basket after acquisition. It fills a local food desert by providing fresh groceries and revitalizing a community resource.","Web Link":"https://www.foodbasketdfw.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"ece1a5d8-7712-4969-a9f5-9234f87f25bd","Organization\nID":"O122","Organization Name":"Services of Hope","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Dallas-based nonprofit founded in 2004 offering food pantries, fresh produce partnerships, furniture, after-school & summer programs, and financial/housing assistance to families facing poverty and homelessness.","Web Link":"https://www.servicesofhope.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"41e05706-5c4a-4885-bb61-70a958906d56","Organization\nID":"O123","Organization Name":"CitySquare","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Major Dallas anti-poverty nonprofit—distributes ~3 million lbs of groceries annually (incl. 400k+ meals for kids), operates a client-choice pantry, housing, health, workforce & advocacy programs, serving ~50,000 people/year.","Web Link":"https://www.facebook.com/CitySquare/","Comments":""},{"@odata.etag":"","ItemInternalId":"88dd6f24-e515-46fd-9824-3530bee3281f","Organization\nID":"O124","Organization Name":"Family Gateway","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Provides 24/7 emergency shelter, comprehensive services (food, child care, education, employment support) to families with children experiencing homelessness in Dallas‑Collin counties, helping them transition to stable housing.","Web Link":"https://familygateway.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"dd638c8c-beed-4483-85f0-5a1b28e6e9e8","Organization\nID":"O125","Organization Name":"Texas Department of Agriculture","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C4","Character":"Legislator","Organization Description":"Administers ARPA‑funded nutrition & food infrastructure grants in Texas—including emergency food, TEFAP and Resilient Food Systems Infrastructure grants—to support school meals, food banks, rural producers and food security.","Web Link":"https://texasagriculture.gov/","Comments":""},{"@odata.etag":"","ItemInternalId":"a99afe11-84e2-4366-9ce5-86343b136b3a","Organization\nID":"O126","Organization Name":"Texas Instruments Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"Through grants and employee-match & volunteer programs, TI Foundation has donated over $6 million since 2018 to North Texas Food Bank, including a $1 million grant in June 2025 to fund 3 million meals.","Web Link":"https://www.ti.com/about-ti/citizenship-community/giving.html","Comments":""},{"@odata.etag":"","ItemInternalId":"41dee471-0bff-4d16-880b-0f7488fa1bbe","Organization\nID":"O127","Organization Name":"Ezekiel Elliott / CentreTX","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"NFL star Ezekiel Elliott partnered with CentreTX apparel company during COVID‑19 to sell merchandise and donate proceeds (about $85k) to the North Texas Food Bank to support hunger relief.","Web Link":"https://www.centretx.com/collections/centre-x-ezekiel-elliott","Comments":""},{"@odata.etag":"","ItemInternalId":"df75e8de-937c-4567-b240-268b17876fdf","Organization\nID":"O128","Organization Name":"Catholic Charities Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Catholic Charities Dallas operates both fixed-location and mobile food pantries across the Diocese of Dallas, distributing over 8 million pounds of food annually—which equates to roughly 1.2 million meals through fixed pantries and more than 5 million via mobile pantries to clients in need. Their services are open to individuals and families meeting federal poverty guidelines, SNAP recipients, and those facing temporary crises, with no paperwork required. They also coordinate food drives, in-kind donations, and partnerships with organizations like the North Texas Food Bank to provide nutritious, client-choice food options to vulnerable communities.","Web Link":"https://www.ccdallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"eae21ec2-6f23-4701-a0df-79a03540dd63","Organization\nID":"O129","Organization Name":"Bonton Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"Bonton Farms is a South Dallas urban farm that transforms vacant land into a source of fresh, organic food and community empowerment. In addition to growing produce and raising livestock, it offers job training, nutrition education, housing support, and wellness programs to address systemic poverty and health disparities. The organization operates a café, market, and mentorship programs to help residents build stable, self-sufficient lives.","Web Link":"https://bontonfarms.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"4fb69319-2102-4a8e-9b34-650e0c9377dc","Organization\nID":"O130","Organization Name":"Good Samaritans of Garland","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"A Garland-based pantry open weekdays that provides supplemental food assistance to roughly 4,000 households monthly—including 500–600 families and unhoused individuals—offering fresh produce and pre‑packaged Weekend Bags for kids. They are a top partner of the North Texas Food Bank and have received recognition like the 2024 Retail Partner of the Year.  ","Web Link":"https://www.goodsamofgarland.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"d84187d1-384d-46d5-9e8c-ef1ebb0e58bf","Organization\nID":"O131","Organization Name":"Jill Stone Community Garden at Temple Emanu‑El","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C16","Character":"Community Garden","Organization Description":"Founded in 2012, this volunteer-run garden grows culturally relevant, organic produce (7,200 lb last year) to donate to neighborhood food pantries like Vickery Meadow, expanding with greenhouses and Master Gardener support to combat food desert challenges. It integrates community engagement, education, and the Jewish principle of tikkun olam.  ","Web Link":"https://www.tedallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"3f588b38-5681-428f-93c1-4b23574c0f84","Organization\nID":"O132","Organization Name":"Kaufman Christian Help Center","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Known as The Center, it serves over 500 Kaufman-area households monthly with groceries via its food pantry and SNAP assistance, plus mobile distributions, senior boxes, job/financial education, hygiene and laundry support, distributing around 320 tons of food in 2023.  ","Web Link":"https://thecenterkaufman.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"e1c44748-fe5d-4c03-8941-db8437fe808c","Organization\nID":"O133","Organization Name":"Hope for Tomorrow","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"A global hunger relief charity providing nutrient-rich porridge, milk, and food packages for vulnerable children and families—offering crisis support like food and housing aid in developing countries through small donations (e.g., £30 feeds a family for a month).  ","Web Link":"https://hftusa.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"b64782f5-3b31-48a9-8678-5e32e6572913","Organization\nID":"O134","Organization Name":"Resource Center Health","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Created with an $85,000 grant from Hope for Tomorrow, Resource Center Health brings primary care rooms, case management offices, and trained staff into one facility. It integrates medical services with existing supports like a food pantry, pharmacy, insurance assistance, and hot meals for a more holistic approach to neighbor wellness.","Web Link":"https://myresourcecenter.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"d79e420b-86e2-4af8-b95d-12359d133221","Organization\nID":"O135","Organization Name":"The Storehouse Community Center","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Formerly Seven Loaves Food Pantry, The Storehouse now supports ~5,000 families monthly with groceries, clothing, case management, and education/job training through The Academy. Serving North Dallas and surrounding areas, it addresses invisible poverty with a full pathway from basic needs to employment readiness.","Web Link":"https://www.thestorehousecc.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"5c0a7586-4c72-4749-aaae-0ed3dc085d9f","Organization\nID":"O136","Organization Name":"Pleasant Grove Pantry","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"An all-volunteer, client-choice pantry serving about 180 families weekly (5,300/month) in Pleasant Grove, distributing over 2 million pounds of food since 2010. As a North Texas Food Bank Partner Agency, it leverages donations, SNAP support, and community referrals to combat food insecurity in a high-need neighborhood.","Web Link":"https://www.pleasantgrovefoodpantry.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"a2397754-d7ad-415b-8924-5288916348b0","Organization\nID":"O137","Organization Name":"DFW International Airport","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C38","Character":"Aviation Institution","Organization Description":"DFW Airport supports the regional food system through a robust concessions program and sustainability efforts that reduce food waste. Initiatives like composting, cooking oil recycling, and liquid disposal divert tens of thousands of pounds from landfills and convert waste into compost or renewable fuel.","Web Link":"https://www.dfwairport.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"7e18075d-30ca-400d-acee-42b59e3e048d","Organization\nID":"O138","Organization Name":"Fraizer Revitalization","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Frazier Revitalization is a nonprofit established in 2005 to drive equitable community development in the historic Frazier neighborhood of South Dallas. Through partnerships with residents, the City of Dallas, and local organizations, they provide affordable housing, health access, youth education, food security, and community engagement to transform the area into a thriving, resilient neighborhood. ","Web Link":"https://frazierdallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"cd814b7e-5d07-4501-a9b8-deb9f93d3ace","Organization\nID":"O139","Organization Name":"Hotel Association of North Texas","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C1","Character":"Regulator","Organization Description":"The Hotel Association of North Texas (HANTX) is a nonprofit trade organization representing about 44,000 rooms across six counties. It advocates for the hospitality industry, provides education and workforce development (including scholarships and training programs), facilitates networking among hotels and suppliers, and supports community engagement through volunteer initiatives.","Web Link":"https://www.hantx.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"ed886c4b-c973-46f7-834b-a97376dbd637","Organization\nID":"O140","Organization Name":"Westin Hotels","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"Westin Hotels is a wellness-focused hotel brand under Marriott International, offering premium hospitality experiences designed around guest well-being. Through amenities like fitness studios and healthy menu options, it serves thousands of travelers and contributes to the food ecosystem as a high-volume institutional food purchaser.","Web Link":"https://westin.marriott.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"a2dde4c1-0ea6-4b7e-b0d5-af33927cb4c6","Organization\nID":"O141","Organization Name":"Chris Howell Foundation","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The Chris Howell Foundation provides critical health, food, and educational resources to underserved populations in Dallas. Since 2016, it has distributed millions of pounds of food while hosting large-scale community wellness events, making it a central player in addressing food insecurity.","Web Link":"https://chrishowellfoundation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"04150ef2-4e1a-4e8f-a021-24702d403f48","Organization\nID":"O142","Organization Name":"Dallas Regional Chamber of Commerce","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"The Dallas Regional Chamber supports business growth and public policy across North Texas, representing thousands of local businesses and institutions. Through workforce development, regional partnerships, and advocacy, it helps shape food policy and supports food-related business growth.","Web Link":"https://www.dallaschamber.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"434b4845-590a-40d2-ba62-04b2639a9f23","Organization\nID":"O143","Organization Name":"Rainwater Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Rainwater Charitable Foundation is a Fort Worth-based private funder investing in scalable solutions to systemic challenges in education, health, and family support. It funds initiatives that improve food access, housing stability, and educational equity in local and international contexts.","Web Link":"https://rainwatercharitablefoundation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"130428c3-490d-4a1e-bcd2-ea5c88b2f207","Organization\nID":"O144","Organization Name":"Truist Bank","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"Truist is a national financial institution that supports communities through banking services and philanthropic giving. It backs workforce development and food security programs through its charitable foundation, particularly in economically vulnerable areas.","Web Link":"https://www.truist.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"534cccf7-7cc1-436a-b85c-fe08279ec1f1","Organization\nID":"O146","Organization Name":"Rees Jones Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Rees-Jones Foundation funds nonprofit efforts that protect and uplift vulnerable children and families, with an emphasis on access to healthcare, food, and education. It makes large-scale investments in local Dallas initiatives that improve quality of life and systemic opportunity.","Web Link":"https://www.rees-jonesfoundation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"b96ee432-79c9-49c6-b42a-9c3fef77d31d","Organization\nID":"O147","Organization Name":"Common Threads","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Common Threads offers hands-on nutrition education and cooking programs for children and families in underserved communities. By promoting healthy eating and food literacy, it helps build community resilience and reduce long-term health disparities.","Web Link":"https://www.commonthreads.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"394b310c-05ee-443f-8a8b-cc2b1d393d63","Organization\nID":"O148","Organization Name":"Perot Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Perot Foundation is a Dallas-based philanthropic organization with a decades-long legacy in fighting hunger through transformational gifts, including a $10.5M donation to the North Texas Food Bank that supported capital campaigns and long-term food security infrastructure.","Web Link":"https://www.philanthropysouthwest.org/redhen/org/2308","Comments":""},{"@odata.etag":"","ItemInternalId":"c9c7d3f8-7f26-4994-bee9-8ce57f481b67","Organization\nID":"O150","Organization Name":"UNT Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"The University of North Texas at Dallas operates hunger-relief initiatives including on-campus student food pantries and monthly mobile food giveaways in partnership with North Texas Food Bank, distributing hundreds of thousands of pounds of food to students and the surrounding southern Dallas community.","Web Link":"https://www.untdallas.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"a29750ed-2f6d-4f9c-8fb7-569047775fdd","Organization\nID":"O151","Organization Name":"Feed Oak Cliff","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Feed Oak Cliff is a grassroots nonprofit addressing food apartheid in southern Dallas by building community-led solutions like a transformative grocery market, bistro, and commercial kitchen to expand access to fresh, affordable food in underserved neighborhoods.","Web Link":"https://feedoakcliff.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"f56d1af1-47e4-466b-bf60-1e117c36d6c7","Organization\nID":"O152","Organization Name":"Nia","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"An innovative startup that has a solution for eliminating food deserts profitably with e-commerce technology and community pick up locations. Nia had several pilots in the Houston area and looking at growth to Dallas at some point","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"5b6edf4a-199d-4348-9233-6cf18e8b8901","Organization\nID":"O153","Organization Name":"The Shops at Red Bird","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C27","Character":"Convenience Store","Organization Description":"The Shops at Red Bird is a revitalization project transforming a former mall in South Dallas into a mixed-use development with retail, housing, healthcare, and community spaces aimed at economic renewal.","Web Link":"https://shopsatredbird.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"1b10db03-0263-4bdc-be0d-9d76346335ca","Organization\nID":"O154","Organization Name":"Hoblitzelle Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Hoblitzelle Foundation is a long-standing Dallas-based private philanthropic foundation funding medical research, education, arts, and social services to improve quality of life in North Texas.","Web Link":"https://hoblitzelle.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"77d7ea91-fbd8-44b5-851e-f9e673cea3c6","Organization\nID":"O155","Organization Name":"Dallas Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Dallas Foundation is a community foundation connecting donors with local nonprofits to address needs in arts, education, health, and economic security through grants and leadership programs.","Web Link":"https://www.dallasfoundation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"41d81b43-4c54-4f10-86cb-ec087b1f64d7","Organization\nID":"O156","Organization Name":"Addy Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The Addy Foundation funds regional nonprofits focused on education, healthcare, and community development, emphasizing equity and sustainable impact across the Southwestern U.S.","Web Link":"https://www.theaddyfoundation.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"c53dc305-9605-496f-8aa1-0defe772553e","Organization\nID":"O157","Organization Name":"Children's Medical Center Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Children’s Medical Center Dallas is a leading pediatric hospital offering comprehensive care, specialty services, and community wellness programs for children in North Texas.","Web Link":"https://www.childrens.com/locations/dallas-campus/childrens-medical-center-dallas?utm_source=google?utm_medium=yext&utm_campaign=Children%27s%20Medical%20Center%20Dallas%20%7C%20%20%7C%20Brand","Comments":""},{"@odata.etag":"","ItemInternalId":"41015788-09ca-4b32-a65c-e888f092b14f","Organization\nID":"O158","Organization Name":"United to Learn","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"United to Learn partners with Dallas ISD elementary schools to improve literacy, student success, and community engagement through volunteers, resources, and school support.","Web Link":"https://www.unitedtolearn.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"4eb5b18f-1cd4-421c-b33a-c2e85aeafad1","Organization\nID":"O159","Organization Name":"Texas A&M Commerce","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Texas A&M University–Commerce (East Texas A&M) delivers undergraduate and graduate degree programs and supports regional growth through research, outreach, and student development.","Web Link":"https://www.etamu.edu/","Comments":""},{"@odata.etag":"","ItemInternalId":"1c75f651-430d-421a-b894-2ec230f0a156","Organization\nID":"O160","Organization Name":"HR&A Advisors","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"HR&A Advisors is a national real estate and economic development consulting firm with a Dallas office, providing urban planning, policy analysis, and strategy services to build equitable, resilient communities.","Web Link":"https://www.hraadvisors.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"0f05ffd8-bbc4-44ec-884c-dec65df3a1a7","Organization\nID":"O161","Organization Name":"VNA Texas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Visiting Nurse Association of Texas offers home-based hospice, palliative care, and Meals on Wheels across North Texas, enabling seniors and medically vulnerable individuals to receive care at home.","Web Link":"https://www.vnatexas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"a778a2e7-fbb9-41be-a1d5-4b511f3e049d","Organization\nID":"O162","Organization Name":"Debra's Healing Kitchen","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Debra's Healing Kitchen is a faith-based wellness nonprofit offering nutrition education, cooking demos, workshops, and school programs to prevent chronic disease in underserved populations.","Web Link":"http://www.debrashealingkitchen.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"0adebba1-f57d-4b90-9b5e-0ddaff0ca86a","Organization\nID":"O163","Organization Name":"McKinsey & Company","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"McKinsey & Company is a global management consulting firm advising corporations, governments, and nonprofits on strategy, operations, digital, and sustainability initiatives with data-driven impact.","Web Link":"https://www.mckinsey.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"ca3bb3b0-4341-4952-9e2a-f3d686c7504f","Organization\nID":"O164","Organization Name":"Giving Tree Acres","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C14","Character":"Small Farm","Organization Description":"Giving Tree Acres is a 501(c)(3) nonprofit community farm in DFW that grows fresh produce for food pantries, school markets, and farmstands in underserved neighborhoods to combat food insecurity.","Web Link":"https://givingtreeacres.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"7688992b-04f3-447d-b4ff-647a20b33063","Organization\nID":"O165","Organization Name":"Empowering the Masses","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Empowering the Masses empowers South Dallas residents through vocational training, life skills, health advocacy, and a Community Market to address economic and food access barriers.","Web Link":"https://www.empoweringthemasses.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"f7c9a6dc-976f-4759-acc3-81874f6c4262","Organization\nID":"O166","Organization Name":"Nextband Partners","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C35","Character":"Corporate Institution","Organization Description":"Nextband Partners is a Dallas-based real estate and investment firm led by Adam Lampert, specializing in commercial development and strategic investment in the local market.","Web Link":"https://pitchbook.com/profiles/advisor/52321-15","Comments":""},{"@odata.etag":"","ItemInternalId":"452fdcff-b8a3-4fb2-8f83-3def679626aa","Organization\nID":"O167","Organization Name":"Mill City Community Association","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Mill City Community Association, founded in 2012 in Oak Cliff, supports neighborhood preservation and development through housing, infrastructure projects, and resident-led engagement.","Web Link":"https://www.millcitycommunityassociation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"0fd8ca44-cc91-4054-bc0b-22574c8e7675","Organization\nID":"O168","Organization Name":"Friendship West Baptist Church","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C40","Character":"Religious Institution","Organization Description":"Friendship-West is a Dallas megachurch with a strong social justice mission, offering ministries that include hunger relief, legal advocacy, scholarships, and community services.","Web Link":"https://www.friendshipwest.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"cbdbb8aa-1066-4c99-9e2e-292b5bc1d6c8","Organization\nID":"O169","Organization Name":"SVP Dallas","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Social Venture Partners Dallas is a philanthropic network that strengthens nonprofits through funding, capacity building, and collaborative impact to scale solutions in the region.","Web Link":"https://svpdallas.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"413cf8db-7e93-47ca-8c0c-229855ee8454","Organization\nID":"O170","Organization Name":"Initiative for Energy Justice","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C4","Character":"Legislator","Organization Description":"The Initiative for Energy Justice (IEJ) is a nonprofit organization focused on ensuring that the transition to clean energy is equitable and inclusive, especially for frontline and marginalized communities. Founded by lawyers of color, IEJ provides policy guidance, legal tools, and research to help communities shape just energy policies. Their work supports advocates and policymakers in embedding equity into renewable energy planning and decision-making.","Web Link":"https://iejusa.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"034ff8df-b10f-4318-bb0c-4fbc7130c484","Organization\nID":"O171","Organization Name":"Stacey D. Brown Coaching and Consulting","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"Stacey D. Brown is a Dallas-based mental health coach, ordained minister, and wellness consultant supporting spiritual leaders and nonprofits. She focuses on trauma-informed care, burnout recovery, and leadership development through coaching, workshops, and speaking engagements.","Web Link":"https://www.staceydbrown.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"fe5e3eb3-727a-4108-ae2e-c1572a05cc9e","Organization\nID":"O172","Organization Name":"Share Our Strength","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Share Our Strength is a national nonprofit organization working to end hunger and poverty in the United States and abroad. It is best known for its No Kid Hungry campaign, which focuses on ensuring all children have reliable access to nutritious food. The organization partners with community groups, advocates for public policy, and provides grants and support to local initiatives.","Web Link":"https://shareourstrength.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"ed609898-d08d-41ab-a176-a01500c2a92c","Organization\nID":"O173","Organization Name":"NorthPark Presbyterian Church","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C40","Character":"Religious Institution","Organization Description":"NorthPark Presbyterian Church is a long-established Dallas congregation with a strong mission orientation. It operates innovative initiatives like the Reverse Food Truck—a mobile food drive—and the SoulFood Greenhouse, which yields thousands of pounds of pesticide-free produce annually for Vickery Meadow Food Pantry and other hunger relief partners. Through these and other outreach programs, the church mobilizes volunteers and community support to combat food insecurity across North Dallas.","Web Link":"https://www.northparkpres.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"8ea32bd9-d1b8-4735-b35e-0e98e05d8bb4","Organization\nID":"O174","Organization Name":"Miles of Freedom","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Miles of Freedom is a Dallas-based nonprofit that empowers individuals, families, and communities impacted by incarceration through reentry programs, employment training, and a no-barrier fresh produce distribution pantry. Since 2019, their MLK Fresh Produce Distribution Center has served all neighbors, distributing over 2 million pounds of food—thanks in part to a capacity grant from North Texas Food Bank. Their holistic model bridges gaps from prison to promise by combining life-skills support with sustainable community food access.  ￼ ￼ ￼ ￼","Web Link":"https://milesoffreedom.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"26b74aeb-e5f0-4122-9057-114f8d126e58","Organization\nID":"O175","Organization Name":"Inland Port","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The Dallas County Inland Port Transportation Management Association (IPTMA) is a nonprofit organization formed in 2019 to enhance transportation access within the 120-square-mile Southern Dallas Inland Port region. It collaborates with employers, local governments, and transit agencies like DART and Uber to provide services such as GoLink and Inland Port Rides, addressing last-mile connectivity for workers. Additionally, IPTMA organizes annual symposia to foster dialogue on workforce development and infrastructure planning.","Web Link":"https://inlandport.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"6a42165b-6ec9-4e77-9ebc-95711f02cecb","Organization\nID":"O176","Organization Name":"New Friends New Life","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"New Friends New Life is a Dallas nonprofit that supports survivors of trafficking and sexual exploitation through trauma-informed care, education, and job training. They operate resource centers for youth and adults and offer urban agriculture apprenticeships to help clients rebuild their lives. The organization also focuses on prevention and community awareness.","Web Link":"https://www.newfriendsnewlife.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"11bd3b19-81b1-4091-997f-4ff72cd16a44","Organization\nID":"O178","Organization Name":"M.E.L. INC. Foundation","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"M.E.L. INC. Foundation (Manage * Elevate * Lead) is a Dallas-based nonprofit founded in 2014 by Mel Jackson to support underserved communities through programs focused on domestic violence, education, and health & nutrition. Initially launched as Mended Hearts Mentoring Program (MHMP), the organization provides career coaching, community partnerships, and personal development resources to empower individuals and strengthen neighborhoods.  ￼","Web Link":"https://melinc.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"82143c55-2580-44d2-bae9-ff27237902c6","Organization\nID":"O179","Organization Name":"Community Lifeline Center","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Community Lifeline Center is a nonprofit based in McKinney serving North Collin County, founded in 1989 by local churches to provide food and emergency assistance to families in crisis. It operates a client-choice grocery-style pantry, weekly mobile food distributions, and offers financial aid for rent and utilities to help prevent homelessness. In 2025, the organization served over 100,000 individuals and continues expanding its pantry services and community partnerships.","Web Link":"https://communitylifeline.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"360fd954-fa27-4191-94e5-e37d3670c4c7","Organization\nID":"O180","Organization Name":"General Food Banks","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C28","Character":"Food Bank","Organization Description":"A grouping of organizations that collect, store, and redistribute donated or surplus food to nonprofits, pantries, and individuals in need.","Web Link":"-","Comments":""},{"@odata.etag":"","ItemInternalId":"0e2b0ad1-579b-4c9b-9656-5b64511ac9b8","Organization\nID":"O181","Organization Name":"General Community Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C16","Character":"Community Garden","Organization Description":"A grouping of various locally focused farms that prioritize community involvement, education, and access over profit, often using sustainable practices.","Web Link":"-","Comments":""},{"@odata.etag":"","ItemInternalId":"e8abc48a-b27e-42b2-967e-6970812bbfc8","Organization\nID":"O182","Organization Name":"General Butchers","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C21","Character":"Butchery","Organization Description":"A grouping of facilities that prepare and sell meat products, often sourcing from farms or processors for local distribution.","Web Link":"-","Comments":""},{"@odata.etag":"","ItemInternalId":"ec53a0f1-87d7-43e4-ba36-81b0914bf68b","Organization\nID":"O183","Organization Name":"General Restaurants","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"A grouping of establishments that prepare and serve meals directly to consumers, often sourcing ingredients from various parts of the supply chain.","Web Link":"-","Comments":""},{"@odata.etag":"","ItemInternalId":"7478390e-02b6-445b-b349-1badb5cd79f5","Organization\nID":"O184","Organization Name":"Recycle Revolution","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C37","Character":"Composter","Organization Description":"Recycle Revolution is a locally owned recycling and composting company in Dallas focused on sustainable waste solutions. They offer commercial and residential pickup services, operate a public drop-off center, and work to promote zero-waste practices across the community. Their mission centers on environmental responsibility and community engagement.","Web Link":"https://recyclerevolutiondallas.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"fbd5e8d8-867b-4e79-9166-107a8d4557fe","Organization\nID":"O185","Organization Name":"South Dallas Families","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C33","Character":"Individual","Organization Description":"Families from South Dallas receiving food.","Web Link":"-","Comments":""},{"@odata.etag":"","ItemInternalId":"e3a8d334-845f-466e-8a11-46debaaafbbe","Organization\nID":"O186","Organization Name":"Comet Cupboard","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"The Comet Cupboard is a student-run food pantry providing perishable and non-perishable food along with personal care items to UT Dallas students. It operates as part of a service-learning initiative, serving thousands of students annually and offering volunteer leadership opportunities.  ","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"bb9be8f2-170b-42ba-b69a-4a8ccf78474c","Organization\nID":"O187","Organization Name":"Luna Farm","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C14","Character":"Small Farm","Organization Description":"Located in the Eco Hub, Luna Farm is a 20,000 sq ft student-led micro-farm and sustainability living lab launched in fall 2021. It uses organic practices to grow fresh produce and maintain an apiary, donating 100% of its harvest to address student food insecurity through the Comet Cupboard. ","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e5bc8a09-a711-4700-a466-1c7713456970","Organization\nID":"O188","Organization Name":"Parkland Patients","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C33","Character":"Individual","Organization Description":"Patients in the Parkland Health Center","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e42814dd-d1d9-43c0-9522-31168ad42311","Organization\nID":"O189","Organization Name":"Brother Bill's Helping Hand","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Brother Bill’s Helping Hand (BBHH) is a nonprofit serving West Dallas since the 1940s, offering a grocery-style food pantry, community health clinic, and educational programs. It provides free primary care, job training, and after-school activities to support families in need. BBHH also co-leads the South Dallas Community Market to increase access to fresh food and wraparound services.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e0b204ae-bfb1-4bd3-9978-a366e28341d8","Organization\nID":"O190","Organization Name":"State Fair of Texas","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"A 501(c)(3) nonprofit event celebrating Texas culture, agriculture, education, and community through its annual 24-day Fair at Fair Park. It draws over 2 million visitors each year and reinvests proceeds into maintaining Fair Park, scholarships, community grants, and educational initiatives.  ￼","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"738c2bc8-3707-4d58-b808-a9eabe8f6ad4","Organization\nID":"O191","Organization Name":"Dallas Bar Association","Pillar\nID":"P6","Pillar":"Legislator","Character\nID":"C1","Character":"Regulator","Organization Description":"Founded in 1873, this professional nonprofit supports Dallas lawyers and promotes connections among the legal community, judiciary, and public. It focuses on legal education, ethics, community service, and access to justice initiatives.  ￼","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"5d80e6f3-7704-4779-8012-d85ab17ffd39","Organization\nID":"O192","Organization Name":"Energy Transfer / Sunoco Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"The philanthropic arm of Energy Transfer LP and Sunoco, that provides grants and supports causes in education, healthcare, hunger relief, veterans, and first responders. In Texas, it has donated to MD Anderson Cancer Hospital, Mercy Street sports ministry, Salvation Army, and regional food banks.  ￼","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"f0a1a746-8b35-4f10-81e4-a1030671edd1","Organization\nID":"O193","Organization Name":"Blue Meridian Partners","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C7","Character":"Philanthropic Agency","Organization Description":"Blue Meridian Partners is a philanthropic investment collaborative focused on transforming the lives of people living in poverty across the U.S. By pooling resources from large-scale donors, it funds both national initiatives and place-based strategies—like Dallas’s Opportunity 2040—that aim to create lasting economic mobility and address systemic barriers. Their model emphasizes long-term, flexible funding to support scalable, data-driven solutions.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"4fe203b4-49dd-4fdd-83a9-b2137f334460","Organization\nID":"O194","Organization Name":"Goodr","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C41","Character":"Waste Recoverer","Organization Description":"Goodr is a tech-enabled logistics company that helps businesses reduce edible food waste by redirecting surplus meals and groceries to underserved communities via a blockchain-tracked system. Operating a model that supports sustainability and social impact, Goodr provides free grocery access in partnership with corporate and public sector clients.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e9b3c855-bae6-4d22-aa55-c0617b9df054","Organization\nID":"O195","Organization Name":"Imperfect Foods","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Imperfect Foods is an online grocery delivery service that rescues cosmetically imperfect or surplus food from farms and manufacturers, selling it at discounted prices to subscribers. The service promotes sustainability and affordability by reducing food waste and providing flexible, customizable delivery options.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"0c87c67a-6688-4a7f-9a15-24dc1c709649","Organization\nID":"O196","Organization Name":"Misfits Market","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Misfits Market is a subscription-based grocery delivery company that sources so-called “ugly” or surplus produce and pantry items—often rejected by traditional grocery retailers—and delivers them directly to consumers at lower cost. It acquired Imperfect Foods in 2022 and continues to expand its reach in reducing food system waste.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"0dd4a7be-57c4-4c2c-9568-9847b2ed0da2","Organization\nID":"O197","Organization Name":"Joppy Momma's Farm","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"Joppy Momma’s Farm is a Dallas nonprofit community farm in the historic Joppa neighborhood founded to rebuild and uplift a former freedmen’s settlement. The organization focuses on sustainable agriculture, growing fresh produce to combat food insecurity, and provides educational and economic opportunities to local families.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"7878a8c4-35e8-4bd5-9258-88bee73257f9","Organization\nID":"O198","Organization Name":"Divert","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C41","Character":"Waste Recoverer","Organization Description":"Divert is a U.S.-based impact-tech company focused on reducing food waste through a circular economy model—Prevent, Provide, Power™. Serving over 6,600 retail locations nationwide, it uses RFID tracking, logistics, and anaerobic digestion technologies to redirect unsold food to communities in need and convert waste into renewable energy. As of 2024, Divert had processed over 3.3 billion pounds of food, facilitated millions of meals, and continues scaling with new infrastructure investments.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"834c7384-b84f-489d-bcbe-f8da222fb09c","Organization\nID":"O199","Organization Name":"Aldi","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Aldi is a fast-growing discount grocery chain in the U.S., known for low prices and a no-frills shopping experience. It operates over 2,400 stores nationwide and is expanding rapidly, including a significant presence in the Dallas area. With plans to open hundreds of new locations, Aldi is becoming a major player in affordable grocery retail across North Texas.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"f215fee6-d526-4726-b661-426a93b0c4d2","Organization\nID":"O200","Organization Name":"U.S. Food Waste Pact","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"The U.S. Food Waste Pact is a national voluntary agreement, led by ReFED and WWF, that brings food businesses together to commit to reducing waste using the “Target, Measure, Act” framework. With quarterly working groups and pilot initiatives, signatories share data, benchmark progress, and scale interventions across the supply chain. It builds on the success of the Pacific Coast Food Waste Commitment and now includes major retailers and industry associations.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"3147ace7-e27d-40ee-ad77-1706b0cd210d","Organization\nID":"O201","Organization Name":"Sodexo","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C42","Character":"Food Service Provider","Organization Description":"Sodexo provides food services to institutions across Dallas such as hospitals, universities, and corporate campuses. Their local operations feature sustainable menu planning, donation of surplus meals, and implementation of waste-tracking systems to reduce food loss and support community-facing food recovery efforts.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"92190230-b07f-4433-b66d-ff4a28e96043","Organization\nID":"O202","Organization Name":"Whole Foods","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Whole Foods operates at least eight stores in the Dallas–Fort Worth metroplex, including key locations in Uptown Dallas and Plano. These stores host community food rescue efforts, surplus giveaways, and support local producers through in-store partnerships, cooking demos, and local vendor showcase initiatives.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"8f91dcb2-e2dc-41a3-b680-2348f6204913","Organization\nID":"O203","Organization Name":"Amazon Fresh","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Amazon Fresh grocery services—including online orders and select physical pickup locations—serve the Dallas area, offering mass-market pricing competitive with traditional grocers. Their operations include discounting near-expiration items, grocery delivery, and partnerships integrated with delivery zones covering Dallas and Fort Worth.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"b62eb7e1-6a1a-4013-b185-259a3c3256a7","Organization\nID":"O204","Organization Name":"Aramark","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C42","Character":"Food Service Provider","Organization Description":"Aramark is a global food service provider that operates in schools, universities, hospitals, and businesses across the U.S., including in the Dallas area. The company manages cafeteria services, catering, and on-site dining programs while also implementing sustainability initiatives like reducing food waste and sourcing responsibly. In Dallas, Aramark partners with local institutions to deliver consistent, large-scale food operations that support both daily consumption and event-based services.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"417d3ba0-c345-47c5-9824-196ddb288d1b","Organization\nID":"O205","Organization Name":"Starbucks","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C27","Character":"Convenience Store","Organization Description":"Starbucks is a multinational coffeehouse chain known for serving coffee, beverages, and light food items in over 35,000 locations worldwide. In Dallas, it operates numerous retail stores that offer dine-in, drive-thru, and mobile ordering services, forming a prominent part of the city’s quick-service food and beverage landscape. The company also integrates retail sales of packaged goods and branded merchandise through its stores.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"626cb6d0-7dbc-422a-b88e-1d84de3fab9c","Organization\nID":"O206","Organization Name":"Grocery Connect","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C43","Character":"Food Delivery","Organization Description":"Grocery Connect—operated in partnership with Bonton Farms, Kroger Delivery, and community centers—is an online grocery ordering and fee‑free pickup service serving underserved neighborhoods in South Dallas. It currently operates staffed pickup hubs at ICDC (serving Frazier and Mill City) and the Dallas Bethlehem Center, complemented by concierge support, SNAP/EBT assistance, healthy meal planning, and cooking education to improve access and nutrition in local food deserts.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"a5b035e1-1735-4b06-adcd-3ea27af586f4","Organization\nID":"O207","Organization Name":"Volunteer Now","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"VolunteerNow is the leading volunteer mobilization hub in North Texas, coordinating over 300,000 volunteers annually and generating significant impact through its proprietary VOLY.org platform, which serves schools, nonprofits, courts, and corporations. They operate a robust Donated Goods program—including Discount Depot storefronts, Goods Giveaways, and Goods Grants—that redistributes essential items to low- and moderate-income communities across DFW. Additionally, they provide key services such as community service restitution, background checks, volunteer manager training, and corporate volunteer activation.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"02fbd866-d8f4-417c-81f7-71ae57db82eb","Organization\nID":"O208","Organization Name":"Yumlish","Pillar\nID":"P7","Pillar":"Food as Medicine","Character\nID":"C5","Character":"Public Health Agency","Organization Description":"Yumlish is a virtual, text- and web-based health-tech organization offering culturally relevant diabetes prevention and nutrition programs for low-income communities, with a Dallas office. It partners with Medicaid/Medicare health plans, employers, Federally Qualified Health Centers, and community organizations to provide accessible coaching (no downloads/logins required), personalized nutrition therapy, and peer/community support. Yumlish aims to improve health outcomes (diabetes, obesity, hypertension) and reduce healthcare costs by addressing socioeconomic & lifestyle barriers through culturally tailored content and scalable digital delivery.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"c053b2c1-2c40-410f-87d2-35590cdf71a9","Organization\nID":"O209","Organization Name":"Texas Health","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Texas Health Resources is a faith-based nonprofit health system serving North Texas with one of the largest networks of hospitals, outpatient clinics, wellness and fitness centers, neighborhood care and wellness facilities, and virtual care. It operates over 29 hospital locations (including major Level I trauma centers and specialty hospitals for heart, vascular, stroke, orthopedics, women’s health, etc.), together with preventive, home health, diagnostic, rehabilitation, and behavioral health services, plus joint-venture affiliate facilities throughout the DFW Metroplex. The organization also invests in community health improvement, workplace wellbeing, and programs that address social determinants of health.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"7ab90d18-b08a-466c-8829-c0b9baa51859","Organization\nID":"O210","Organization Name":"Dallas ISD","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Dallas ISD is the largest public school district in Dallas County and one of the largest in Texas, serving Pre-K through 12 with over 230 schools, 22,000+ staff, and offering a wide variety of school choices including legacy, transformation, and innovation schools. It operates major programs in early learning, career/technical education (Career Institutes), teacher development, and strategic compensation, alongside robust transportation, food & child nutrition, facilities, and operations services to support academic achievement across the district. The district is also focused on improving student outcomes, expanding public school choice, and ensuring equity through targeted school redesign and innovation.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"03c6a3ee-4fba-448d-b11e-128301697028","Organization\nID":"O211","Organization Name":"One Community Church","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C40","Character":"Religious Institution","Organization Description":"One Community Church is a multi-campus church based in North Texas with locations in Plano, Prosper, Garland, Lewisville, McKinney, Dallas, plus online/global and metaverse campuses. They offer regular worship services, membership, life groups, ministries for all stages (kids, students, young adults, etc.), outreach missions, volunteer opportunities, and events aimed at spiritual growth, community connection, and service. Their operations include pastoral care, counseling, stewardship trainings, generosity programs, and many events to engage both local and virtual congregants.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"348675b7-1aad-4afd-9158-bc24a74b0373","Organization\nID":"O212","Organization Name":"Texas A&M AgriLife Extension Program","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Texas A&M AgriLife Extension Service operates a statewide educational outreach network with offices in all 254 Texas counties, professional educators, trained volunteers, and regional specialists to deliver research-based programs in agriculture, natural resources, health, and environment. They provide tools, training, publications, apps, and local support to improve well-being, economic resilience, and environmental sustainability, with strong engagement through programs like 4-H, disaster recovery, and county-level issue-adaptation. The agency combines grassroots presence with modernized digital tools to meet local and emerging challenges across Texas.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"559279a1-79dc-45e2-bd8b-27262f132f6b","Organization\nID":"O213","Organization Name":"The Concilio","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The Concilio is a Dallas-based nonprofit working to empower Latino and diverse families through education, community health, mental wellness, and advocacy programs. Its offerings include parent-engagement programs (e.g., PAL, PASE), health fairs and wellness initiatives, culturally-competent trainings, and research (like their “State of Latinos” report) to identify and address systemic barriers in education, health, and economic opportunity. It serves thousands annually across North Texas, striving both to provide direct services and to drive broader strategy & policy change through its Latino Strategy Institute.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"8c51bd1a-f99b-40cd-b482-1368d3c9c732","Organization\nID":"O214","Organization Name":"Cafe Momentum","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Café Momentum is a nonprofit in Dallas that transforms the lives of justice-involved youth (ages 15-19) through a year-long paid apprenticeship program in its restaurant, providing job training, life skills, support networks, and opportunities to rewrite their futures. Since its founding, it has served over 1,300 young people, combining employment in culinary arts with mentorship, education, and personal growth. Their model uses restaurants both as a platform for skill-building and community transformation.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"6f13da8e-42f9-4778-becb-1a80ee8a2c0c","Organization\nID":"O215","Organization Name":"Kelley Produce","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C17","Character":"Commercial Farm","Organization Description":"Kelley Produce is a locally-owned grocery vendor at the Dallas Farmers Market, run by Keith Kelley and Janiece Black, offering fresh produce (sourced from Texas and beyond), grocery staples, and soon expanded items like milk, eggs, fruit cuts, and home goods. The business combines farming, produce sourcing, and wholesale/custom order services, with deep roots in East Texas agriculture and a mission to build community through food and farming.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"0b6b25cd-ca22-41fb-8199-75d5afc6ada1","Organization\nID":"O216","Organization Name":"Cox Farms Market","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C24","Character":"Grocery Store","Organization Description":"Cox Farms Market is a family-owned natural foods grocery chain with three locations in Duncanville, Farmers Branch, and West Dallas, serving the DFW community since 1991. The stores emphasize fresh produce, local goods, natural and organic grocery items, vitamins, and a full-service nursery in Duncanville. They focus on community-based, neighborhood shopping experiences with healthy, sustainable food choices.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"3de12bef-a273-44c0-a889-7721937c65ff","Organization\nID":"O217","Organization Name":"Valesco Industries","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"Valesco Industries is a Dallas-based private equity firm that makes majority and minority investments in small and lower middle-market companies across manufacturing, value-add distribution, and business services. Beyond capital, they act as long-term partners by providing operational expertise, strategic guidance, and growth support, including M&A execution and leadership development. Their portfolio includes food-related businesses such as Adams Flavors, Foods & Ingredients, demonstrating their role in scaling and strengthening regional enterprises.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"63f7d3ea-68ab-44c0-9942-8f33d5f56698","Organization\nID":"O218","Organization Name":"For Oak Cliff","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"For Oak Cliff is a community nonprofit based in southern Dallas (75216 Superblock) dedicated to liberating residents from systemic oppression through culturally relevant education, advocacy, and resource programs. They operate a Community Campus that offers free programs such as GED classes, youth enrichment, health and wellness workshops, workforce development, and their annual Back to School Festival. The organization serves as a collective impact backbone, building social capital and mobility by working hand-in-hand with local families.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"7c887bc4-0d81-47aa-bfa4-6bb1b4fd3a58","Organization\nID":"O219","Organization Name":"Sharing Life","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C34","Character":"Food Pantry","Organization Description":"Sharing Life Community Outreach is a Mesquite-based nonprofit serving Dallas County with food, clothing, financial assistance, and educational programs for families in crisis. Its services include a large food pantry and community distribution network, emergency rent and utility assistance, financial empowerment programs, tax prep (VITA), and the W.A.R.M. shelter program. In 2024 alone, it distributed over 12 million pounds of food and provided hundreds of thousands of dollars in direct financial support to stabilize vulnerable households.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"edb5d184-b44b-4957-9afe-c36732a935a6","Organization\nID":"O220","Organization Name":"Texas Tree Company","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"Texas Tree Company provides arborist and land management services across Texas, with expertise in soil health, tree care, risk assessment, and long-term monitoring. Their services include pruning and removal, construction impact mitigation, stress/pest/disease treatment, aeration and decompaction, mulching and composting, and microbiome support to sustain healthy landscapes. They also offer consultation, plant inventory, and their EVERGREEN monitoring program to help communities and landowners manage and protect tree and soil ecosystems.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"72a00d2b-1ede-4cdc-a57a-543976542a98","Organization\nID":"O221","Organization Name":"Chefs For Farmers","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C11","Character":"Community Food Network","Organization Description":"Chefs For Farmers is a food and wine festival founded in Dallas in 2010 that brings together top chefs and local farmers to celebrate Texas flavors while supporting sustainable agriculture. It now hosts multi-day festivals in Dallas and Houston, along with curated events year-round, showcasing culinary talent and creating business opportunities for farmers and producers. A portion of proceeds each year supports nonprofit partners advancing education, agriculture, and community sustainability.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e1e3bac0-8021-4feb-a46d-74e31d058b22","Organization\nID":"O222","Organization Name":"Restaurant Beatrice","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Restaurant Beatrice is a contemporary Cajun/Creole restaurant in North Oak Cliff, Dallas, serving heirloom recipes and scratch-made seasonal food (including indoor dining and outdoor communal seafood boils). They emphasize Louisiana-inspired hospitality, local sourcing, minimal waste (“circular sustainability”), and making everyone feel welcome. The restaurant has received accolades like being a finalist for the James Beard “Best New Restaurants” award, and “Restaurant of the Year” by Dallas Eater.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"63e37b14-0371-419f-9f95-0e8ff27e5c1f","Organization\nID":"O223","Organization Name":"Jimmy's Food Store","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Jimmy’s Food Store is a family-run Italian grocery and deli in Dallas, owned by the DiCarlo family, with roots back to 1944. It specializes in authentic Italian imports (olive oils, pastas, sweets), housemade items (sausages, meatballs, sauces), a large deli counter, iconic East Coast-style subs, and over 400 Italian wines, all served with a warm, local, neighborhood atmosphere. Especially around holidays the store is a community anchor — people line up for lasagnas, Italian goods, and it’s known for being the place locals go to feel a taste of home.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"d3e0c60c-0dd5-4dd5-9ff6-efb89cc2adf0","Organization\nID":"O224","Organization Name":"Chefs' Produce","Pillar\nID":"P3","Pillar":"Distributor","Character\nID":"C29","Character":"Wholesaler","Organization Description":"Chefs’ Produce is a Texas-based produce wholesaler founded in 1980, with distribution centers in Dallas–Fort Worth and Houston. They supply restaurants, hotels, country clubs, and other foodservice clients with fine produce, specialty items, organics, and pre-cut products, all maintained through a continuous cold-chain across eight climate-controlled storage environments. Their fleet of 40+ refrigerated trucks delivers six days a week, ensuring year-round freshness and reliability in the DFW metroplex.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"9d781f9a-7d0e-42d4-b64b-8f643b60a955","Organization\nID":"O225","Organization Name":"Roots Southern Table","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"Roots Southern Table, located in Farmers Branch, is a restaurant from Chef Tiffany Derry and Tom Foley that reimagines Southern cuisine by honoring family traditions like field-to-table eating, canning, and communal gatherings. The menu highlights seasonal, scratch-made dishes such as duck-fat fried chicken, gumbo, and crawfish boils, paired with a focus on sustainability and hospitality that feels like “coming home.” Nationally acclaimed, it has been recognized on The New York Times “Restaurant List” and as one of Esquire’s “40 Best New Restaurants in America.”","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"382b0d47-6df4-4a72-8a71-1686752007b6","Organization\nID":"O226","Organization Name":"Texas Pure Products","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C37","Character":"Composter","Organization Description":"Texas Pure Products, operated by the City of Plano, is a regional supplier of organic compost, soil blends, mulch, and sand products made from recycled yard trimmings and food waste collected across North Texas. With a facility in Plano, it diverts organic material from landfills and transforms it into sustainable landscaping and gardening products for residents, businesses, and municipalities. Their efforts support soil health, water conservation, and waste reduction across Collin County and surrounding communities.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"2a72f319-35a0-4ab6-b1c3-e119b4bc517d","Organization\nID":"O227","Organization Name":"Living Earth","Pillar\nID":"P5","Pillar":"Recoverer","Character\nID":"C37","Character":"Composter","Organization Description":"Living Earth, headquartered in Dallas, is a landscaping and recycling company that takes clean green waste and transforms it into organic mulch, soil blends, compost, sand, decorative rock, and similar products. They operate a network of ~30 locations across Texas and Tennessee, servicing homeowners, landscape contractors, municipalities, etc., with both retail pickup and delivery options. Their operations emphasize sustainability via green waste diversion, local production, earth-friendly materials, and recycling.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"921d536b-3b49-4add-ad24-9ece6aa503c3","Organization\nID":"O228","Organization Name":"Skyline High School","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Skyline High School, part of Dallas ISD, is one of the largest high schools in Texas and a nationally recognized magnet school known for its Early College and career pathway programs. It offers specialized tracks in areas like STEM, health sciences, law, horticulture, JROTC, and the arts, while also providing AP, dual credit, and college readiness support. Skyline combines comprehensive academics with robust extracurriculars, athletics, and community engagement, preparing students for higher education and careers.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"dbcfe44f-7597-4ff0-abe4-09e9f13109f2","Organization\nID":"O229","Organization Name":"Jesuit Dallas","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"Jesuit Dallas is a private, Catholic, all-boys college preparatory school serving grades 9–12, rooted in the Jesuit tradition of forming “Men for Others.” Alongside rigorous academics, the school emphasizes spiritual formation, service and justice, athletics, and global education, seeking to develop intellectually competent, compassionate, and socially responsible graduates. It provides extensive extracurriculars, leadership programs, and a strong alumni network to support lifelong growth and community impact.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"2df0deb6-ec21-4a1f-a99e-62799b533e10","Organization\nID":"O230","Organization Name":"Arete Health","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C32","Character":"Medical Institution","Organization Description":"Arete Health, headquartered in Dallas, offers a next-generation health insurance model that integrates preventive “health journeys” such as InnerAge testing, AI-enhanced heart scans, and continuous glucose monitoring into employer-based coverage. By combining proactive diagnostics, lifestyle insights, and simplified access to science-backed wellness services, Arete aims to improve long-term health outcomes, increase workforce engagement, and reduce overall healthcare costs. Their approach blends traditional insurance with cutting-edge preventive care tailored for employers and employees.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"bc087580-24c1-42b2-ae36-08c09909c479","Organization\nID":"O231","Organization Name":"Hiland Dairy","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C20","Character":"Dairy Processor","Organization Description":"Hiland Dairy is a farmer-owned dairy company and part of the Prairie Farms family, producing milk, yogurt, cheese, ice cream, butter, and other dairy and beverage products distributed throughout the South-Central U.S. With production facilities in Texas, Oklahoma, and surrounding states, it emphasizes local sourcing, sustainability, and community partnerships such as school milk programs and support for child-health nonprofits. Its operations focus on quality, freshness, and reducing environmental impact through responsible farming and processing.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"e9d47e78-186a-4983-9669-e9f8b064534a","Organization\nID":"O232","Organization Name":"Fort Worth Meat Packers","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C21","Character":"Butchery","Organization Description":"Fort Worth Meat Packers is a family-owned USDA-certified meat processing and packaging company located in the Fort Worth Stockyards, serving both wholesale and private-label clients. It processes a wide range of proteins—including beef, bison, pork, lamb, goat, poultry, and game—with specialty certifications for natural, organic, kosher, halal, and grass-fed products. The company operates advanced facilities in Fort Worth and Arlington, offering custom cuts, grinds, ready-to-eat processing, and packaging for both retail and foodservice customers.","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"474b96e5-e91d-4810-b4c6-78801aa28405","Organization\nID":"O233","Organization Name":"Apogee Foods","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C22","Character":"Processing Plant","Organization Description":"Apogee Foods, headquartered in Dallas, is a gluten-free, SQF-, and kosher-certified contract manufacturer specializing in natural snack bars, extruded products, bakery items, and chocolate-enrobed foods. They offer end-to-end services from recipe development and nutritional analysis to full-scale commercialization, logistics, and demand planning for health-conscious food brands. Their 40,000 sq. ft. facility emphasizes safety, traceability, and clean-label production to deliver premium natural food products nationwide.","Web Link":"https://apogeefoods.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"d37cc46b-7ff6-4135-8caa-52a96f157cc1","Organization\nID":"O234","Organization Name":"Dallas USA Foods","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C21","Character":"Butchery","Organization Description":"Dallas USA Foods is a BRC-certified and USDA process-verified poultry processing company that has operated in North Texas for over 25 years. It specializes in hand-cut chicken products—including fillets, strips, nuggets, and trims—and offers marinating, packaging, and co-packing services for retail and foodservice clients. The company emphasizes food safety, quality assurance, and customer-centric solutions, supported by a professional FSQA team adhering to rigorous standards.","Web Link":"https://dallasusafoods.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"551316b1-057f-467a-bd70-e34e499b9e27","Organization\nID":"O235","Organization Name":"Rio Star Foods","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C21","Character":"Butchery","Organization Description":"Rio Star Foods is a USDA-certified poultry processor based in Dallas, Texas, specializing in custom hand-cut and portioned chicken products for wholesalers, distributors, manufacturers, retailers, and foodservice operators. The company produces fresh and frozen cuts, using individual quick freezing (IQF) and blast freezing technologies to maintain taste and quality, alongside marination and custom packaging services. It processes tens of millions of pounds annually under strict HACCP and USDA food safety standards.","Web Link":"https://www.riostarfoods.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"fd791bcf-69e4-4f26-8b65-a7ae6f76a9e3","Organization\nID":"O236","Organization Name":"FreshPoint","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C23","Character":"Food Logistics","Organization Description":"FreshPoint, a division of Sysco Corporation, is North America’s largest wholly owned produce distributor, providing fresh fruits, vegetables, herbs, and specialty items to restaurants, retailers, and institutions. With multiple regional facilities—including in Dallas—it offers services like fresh-cut processing, tomato repacking, local farmer sourcing, and customized logistics. The company emphasizes food safety, sustainability, and local partnerships to ensure quality, traceability, and support for regional agriculture.","Web Link":"https://www.freshpoint.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"b8ee0166-0122-49f9-a284-5d2ed56e34f1","Organization\nID":"O237","Organization Name":"55 Seventy","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C30","Character":"Restaurant","Organization Description":"55 Seventy is a private members’ club in Dallas’ Park Cities offering luxury wine storage, fine dining, and curated culinary experiences led by Chef Josh Sutcliff. The club combines an elevated food and beverage program with exclusive events—ranging from sommelier-led tastings to business networking and live entertainment—within a refined social setting. Members enjoy access to personal wine storage, brokerage services, and over 150 curated events each year.","Web Link":"https://dallas.55seventy.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"f501231e-b0b4-4ae2-889c-298535621ee1","Organization\nID":"O238","Organization Name":"AdvoCare Foundation","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C8","Character":"Grantmaker","Organization Description":"The AdvoCare Foundation, based in Richardson, Texas, is a 501(c)(3) nonprofit dedicated to helping children and families live healthier, safer, and happier lives. It partners with organizations across the U.S. to combat the effects of childhood obesity, food insecurity, and unhealthy lifestyles through education, grants, and community programs. The foundation’s mission is to empower communities and ensure all children have access to nutritious food, wellness opportunities, and supportive environments.","Web Link":"https://advocarefoundation.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"5a31dfcb-9331-4cb9-823b-ae82dab3fb24","Organization\nID":"O241","Organization Name":"Arkearth","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Arkearth is a Richardson-based 501(c)(3) nonprofit dedicated to protecting pollinators such as bees, butterflies, bats, and hummingbirds through habitat restoration, education, and community partnerships. Founded in 2022, it develops “pollination accelerator” projects in urban farms, community gardens, and parks, planting millions of wildflowers and engaging volunteers to combat food deserts and biodiversity loss. The organization also provides public education, pollinator management resources, and swarm reporting tools to promote environmental stewardship across North Texas.","Web Link":"https://www.arkearth.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"cc4def7b-0fbe-44b9-b4e5-fd4405c19c34","Organization\nID":"O242","Organization Name":"Armagh Creamery","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C20","Character":"Dairy Processor","Organization Description":"Armagh Creamery is a farmstead organic dairy located in Dublin, Texas, producing raw milk, cream-top yogurt, and artisan double-cream cheese entirely on-site using milk from its pasture-raised cows. The creamery follows certified organic, non-GMO, and hormone-free practices, emphasizing freshness, traditional methods, and nutrient-rich, small-batch dairy production. Its products are sold through local farmers markets, retail partners, and a direct “Creamery Club” subscription program.","Web Link":"https://www.armaghcreamery.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"21f14cf2-88de-4971-b980-5c8f651da6b3","Organization\nID":"O243","Organization Name":"Balcony Box","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"Balcony Box is a Dallas–Fort Worth–based educational gardening company that teaches people how to grow their own organic food through container gardening memberships and community partnerships. Members receive personalized growing plans, seasonal plants, and expert support, with options for video consultations and gardening materials. The company also collaborates with churches, housing developers, and community groups to transform underused spaces into thriving community gardens.","Web Link":"https://www.balcony-box.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"9cc40bcc-0ae3-4ce3-bc23-2d8eda6fe25e","Organization\nID":"O244","Organization Name":"Bishop Hill Farm Flowers","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"https://bishophillfarmflowers.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"ab463144-ada5-4fb8-ace3-7270d0ba3859","Organization\nID":"O246","Organization Name":"Cafe Dior by Dominique Crenn","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"98cfa036-5cd1-433b-9119-320e589416cf","Organization\nID":"O247","Organization Name":"Christen Colbert","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"28bcb2ff-dff8-4ff2-8d54-f7607ccda7b0","Organization\nID":"O248","Organization Name":"City of Austin","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"750a2392-fe51-430a-a570-4f0ddd305519","Organization\nID":"O251","Organization Name":"22 Concordia Farms","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C17","Character":"Commercial Farm","Organization Description":"22 Concordia Farms’ “Bees Biz” division operates on their Whitewright, TX property where they raise honey bee colonies for pollination services and produce a variety of bee products such as “Texas Wild” honey and beeswax candles. They provide full beekeeping services including hive management, swarm removal, and package bee sales, emphasizing the role of apiculture in supporting agriculture and biodiversity across North Texas. Their operations underline the farm’s broader regenerative mission while offering specialized bee-related products and services to area landowners and growers.","Web Link":"https://www.22concordiafarms.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"56153c15-af72-4ccf-931a-acea11a86c72","Organization\nID":"O252","Organization Name":"Cornerstone Community Garden","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C9","Character":"Urban Farm","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"a31a4574-04df-40fb-8cfd-ec3e1d5d50e5","Organization\nID":"O253","Organization Name":"Council for Healthy Food Systems","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"88bbdddb-8663-4c92-8a3a-344c9c3c1571","Organization\nID":"O255","Organization Name":"Dallas Farmers Market","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"b6985e98-0afe-400e-ba5b-d08971965d86","Organization\nID":"O256","Organization Name":"Dallas Half Acre Farm","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"09af6926-0659-4831-8b0b-c70f16690612","Organization\nID":"O257","Organization Name":"David's Chapel Missionary Baptist Church","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C40","Character":"Religious Institution","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"41b78389-116f-4a1f-b025-e9d9ab077d7e","Organization\nID":"O258","Organization Name":"Denver Urban Gardens","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"6b0657d6-224f-4dba-a5b4-42260fa5318f","Organization\nID":"O259","Organization Name":"Dolphin Heights Community Garden","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"a06ffbf0-d828-4566-aee4-e16004afa810","Organization\nID":"O260","Organization Name":"East Texas A&M University","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"6fdee2cd-1228-4f91-8b96-f589150b71ab","Organization\nID":"O262","Organization Name":"Engineers Without Borders","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"8e5c073d-0f8c-4f7a-9fd6-53b3dbcb6666","Organization\nID":"O264","Organization Name":"Feeding America","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"a8bc7c09-1b7b-4c72-8ff2-eacdd6d2e1dd","Organization\nID":"O265","Organization Name":"Food Pulse Foundation","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"6bfdcba3-d549-4283-8580-ae1488f199b6","Organization\nID":"O266","Organization Name":"Garland ISD","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"8ef601c6-6185-4ddf-9a80-84acf8211f91","Organization\nID":"O267","Organization Name":"Good Local Markets","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"d83133b5-78b2-4488-b2de-51e07f5385d3","Organization\nID":"O269","Organization Name":"Grow Garden Grow","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"490ba552-9bd5-4ac3-8b93-fc82fc9b7c15","Organization\nID":"O272","Organization Name":"Hort Americas","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"ef8bd81e-e173-4fed-8239-290e56f2dd2e","Organization\nID":"O274","Organization Name":"Infused by Zen","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"2414f3ea-cbd3-496a-b416-c231d1ea9a72","Organization\nID":"O275","Organization Name":"Johnny's Selected Seeds","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"1cecc6cf-6879-499b-bbbe-f78df87f56f4","Organization\nID":"O277","Organization Name":"Jubilant Farms","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"a1123c06-6a78-4c43-b5c7-09c825b5136f","Organization\nID":"O279","Organization Name":"Lake Highlands Community Garden","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C16","Character":"Community Garden","Organization Description":"Located in Dallas, the Lake Highlands Community Garden spans 2.27 acres and includes over 100 individual organic plots, a donation garden, and specialty areas like a bee sanctuary and butterfly garden, all operated entirely by volunteers. The garden distributes thousands of pounds of fresh produce each year to local food pantries while offering community events, gardening education, and inclusive plot rentals to people of all ages and backgrounds. Its operations focus on food access, neighborhood connection, and sustainable urban agriculture in the Lake Highlands neighborhood of Dallas.","Web Link":"https://www.lhgarden.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"ae7cfba2-7ab7-4bee-8fec-eb01935e5f59","Organization\nID":"O280","Organization Name":"Learning Gardens","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C14","Character":"Small Farm","Organization Description":"The Learning Gardens is a 501(c)(3) nonprofit off-grid permaculture farm and outdoor education center near Athens, Texas, that teaches nature-based living through regenerative agriculture, foraging, and hands-on environmental education. The organization restores a formerly degraded quarry site using regenerative practices while hosting public programs such as youth forest classes, Little Sprouts, bushcraft Saturdays, yoga, and the Texas Permaculture Expo, drawing participants from across East and North Texas, including the wider DFW region. Its work focuses on rebuilding healthy ecosystems and cultivating community connection, skills, and resilience through land-based learning.","Web Link":"https://www.instagram.com/learning_gardens/","Comments":"https://www.facebook.com/groups/1500651116761004/"},{"@odata.etag":"","ItemInternalId":"afa78818-b809-40cf-8595-8b86e46696dc","Organization\nID":"O281","Organization Name":"Local Foods Group","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"ceaaa9ee-7ab3-42ba-87a4-caf8b92fd255","Organization\nID":"O282","Organization Name":"Maya X Kiwi","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"f3de3bd1-7ad9-4f33-b352-28bde31e2dcb","Organization\nID":"O285","Organization Name":"Mushroom Street Farms","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"384f05e0-8ce5-4902-921c-2fef92bddaca","Organization\nID":"O288","Organization Name":"NxT Horzon LLC","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"3b062fb3-429d-46f9-ae3d-6dcd3b738a8a","Organization\nID":"O289","Organization Name":"Parlor's Ice Creams","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"86aaeada-ad51-4b49-afe9-cf852ccf3fd5","Organization\nID":"O290","Organization Name":"Profound foods","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"2412b290-72af-452e-9db6-4107c88b6fa1","Organization\nID":"O291","Organization Name":"Raised Wild Texas","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"c4a766ac-3fe1-4402-b374-5826c7978638","Organization\nID":"O292","Organization Name":"Re^human.earth","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"b51d7754-63d4-4490-aacb-5d214d55d7d2","Organization\nID":"O293","Organization Name":"Reeves Family Farm","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"3b4faf4c-599c-4d86-bec6-7f58395fd5b3","Organization\nID":"O295","Organization Name":"Roots Beneath the Sunset","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"0cf19633-6587-4a94-a5e4-9c3f8229b46d","Organization\nID":"O296","Organization Name":"Saint Arnold Brewing","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"ada41d8d-4d61-4c25-ba89-a9e448acdd0c","Organization\nID":"O297","Organization Name":"Sample Inc","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"cc51440f-00dc-4145-a4bf-edb7c7468976","Organization\nID":"O299","Organization Name":"Silver Streaks Farm","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"5cf827e2-3497-44fe-9da2-416dde3a4d8a","Organization\nID":"O300","Organization Name":"Soilutions Holistic Agricultural Operations, NPO","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"4ce38798-8ea1-4b8f-8ef7-89b908ab5634","Organization\nID":"O301","Organization Name":"Square Mile Community Development","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"f61d2ae4-fc56-460b-ac8d-a1765f5dd592","Organization\nID":"O302","Organization Name":"Sublingual","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"82316122-2f71-42ce-b05a-6f020ea2ba68","Organization\nID":"O304","Organization Name":"Temple Shalom Justice Garden","Pillar\nID":"P1","Pillar":"Producer","Character\nID":"C16","Character":"Community Garden","Organization Description":"The Temple Shalom Justice Garden is a volunteer-run garden in North Dallas that grows fresh vegetables and herbs for local food pantries and hunger-relief partners, including the North Texas Food Bank and the Vickery Meadow Food Pantry. Congregants and community volunteers plant, harvest, and maintain the garden, using it as a hands-on space for service learning, environmental stewardship, and community engagement. Its operations focus on addressing food insecurity through fresh-produce donations while integrating Jewish values of tikkun olam—repairing the world.","Web Link":"https://templeshalomdallas.org/tikkun-olam/justice-garden/","Comments":""},{"@odata.etag":"","ItemInternalId":"79cfe745-dd88-45c1-8b00-43f178d5eb08","Organization\nID":"O305","Organization Name":"Texas A&M AgriLife Extension Service","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"002aac39-92af-4612-92f4-46b1bf0d7d8c","Organization\nID":"O306","Organization Name":"Texas A&M AgriLife Institute for Advancing Health Through Agriculture","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"25425618-ff4d-4ff8-b8d9-9da31f371272","Organization\nID":"O308","Organization Name":"The Common Market Texas","Pillar\nID":"P2","Pillar":"Processor","Character\nID":"C23","Character":"Food Logistics","Organization Description":"The Common Market Texas is a mission-driven food distributor connecting institutions and communities with sustainably grown food from local Texas farmers. Based in Houston and serving the DFW region, it provides wholesale delivery to schools, hospitals, senior centers, and nonprofits while offering Farm-Fresh Box programs to improve food access. Its work strengthens regional farm economies and expands equitable access to healthy, local foods across North and Central Texas.","Web Link":"https://www.thecommonmarket.org/locations/texas","Comments":""},{"@odata.etag":"","ItemInternalId":"a99f1e9d-a10d-4862-83ef-4bb31a650f71","Organization\nID":"O310","Organization Name":"The Giving Garden","Pillar\nID":"","Pillar":"","Character\nID":"","Character":"","Organization Description":"","Web Link":"","Comments":""},{"@odata.etag":"","ItemInternalId":"56fba50d-bf63-437a-b260-be909381b244","Organization\nID":"O311","Organization Name":"The Hockaday School","Pillar\nID":"P4","Pillar":"Preparer","Character\nID":"C31","Character":"Educational Institution","Organization Description":"The Hockaday School is an independent, college-preparatory day and boarding school for girls in Dallas, serving students from pre-K through 12th grade. The school provides a rigorous academic program alongside athletics, arts, and leadership development, and maintains campus initiatives such as gardens, sustainability programming, and community partnerships. Its mission centers on educating young women to lead lives of purpose and impact in Dallas and beyond.","Web Link":"https://www.hockaday.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"c96ce0ce-4adf-4095-aee7-b4a6681996d6","Organization\nID":"O315","Organization Name":"Weber Therapeutic Nutrition","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"Weber Therapeutic Nutrition, LLC provides individualized medical nutrition therapy, meal planning, and therapeutic dietary guidance for clients managing chronic conditions, digestive disorders, and specialized nutrition needs in the DFW region. The practice offers one-on-one consultations, customized nutrition plans, and ongoing wellness support, integrating evidence-based clinical nutrition with practical, food-focused strategies. Its operations center on improving patient health outcomes through personalized nutrition care and accessible support services.","Web Link":"https://www.weber-therapeutic-nutrition.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"950ef8f2-dedf-4cd0-8c8f-12d78aa9a87a","Organization\nID":"O316","Organization Name":"West Dallas Multipurpose Center","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The West Dallas Multipurpose Center, operated by the City of Dallas’s Office of Community Care & Empowerment, serves as a hub for social services in West Dallas, offering housing and rental assistance, financial empowerment, job-skills training, and client referral services. Established in 1988 at 2828 Fish Trap Road, it partners with nonprofits to deliver health and wellness programming, senior services, and food-access support across ZIP codes including 75212. Its operations are designed to build community resilience and reduce barriers for residents facing poverty, limited English proficiency, or transportation challenges.","Web Link":"https://dallascityhall.com/departments/community-care/Pages/wdmc.aspx","Comments":""},{"@odata.etag":"","ItemInternalId":"8584a5aa-b5fd-4eab-b7a4-0511d736de37","Organization\nID":"O317","Organization Name":"White Rock Chapel of Addison, Inc","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C40","Character":"Religious Institution","Organization Description":"White Rock Chapel of Addison is a historic African American church established in the late 1800s and recently restored to serve as both a worship space and a community gathering place in Addison. The chapel hosts religious services, cultural events, educational programs, and community celebrations while preserving the legacy of one of the area’s earliest freedmen’s settlements. Its operations focus on faith, heritage preservation, and strengthening community connection in the North Dallas region.","Web Link":"https://whiterockchapelofaddison.org/","Comments":""},{"@odata.etag":"","ItemInternalId":"736c6fe1-027f-479f-b105-ed26ada114f2","Organization\nID":"O318","Organization Name":"With & Thru Strategies","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"With & Thru is a Dallas-based movement-building organization that develops community leadership and collective action through workshops, coaching, storytelling, and local partnerships. The group supports residents, grassroots organizations, and coalitions in building power around social justice issues by providing facilitation, strategy development, and community-centered training. Its work focuses on strengthening relationships, amplifying community voice, and equipping local leaders to drive long-term, systems-level change in the DFW region.","Web Link":"https://www.withandthru.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"bdc0270a-1574-401c-acde-bd7415285b8d","Organization\nID":"O319","Organization Name":"Worth Street Partners","Pillar\nID":"P8","Pillar":"Connector","Character\nID":"C39","Character":"Consultant","Organization Description":"Worth Street Partners is a Dallas-based consulting and advisory firm specializing in community development, social impact strategy, and cross-sector partnerships. The firm works with nonprofits, foundations, and public agencies to design programs, secure funding, and create data-driven solutions that strengthen local communities. Its operations in the DFW region focus on helping organizations build capacity, measure impact, and advance equitable, sustainable development initiatives.","Web Link":"https://worthst.com/","Comments":""},{"@odata.etag":"","ItemInternalId":"785f7b49-5b40-49ec-8b2f-4e90a8b3686e","Organization\nID":"O320","Organization Name":"North Texas Alliance for Urban Agricultural Education","Pillar\nID":"P10","Pillar":"Volunteer","Character\nID":"C6","Character":"Community Nonprofit","Organization Description":"The North Texas Alliance for Urban Agricultural Education fosters collaboration among urban agriculture stakeholders in the DFW region by delivering educational programs, research partnerships, and community workshops to support local growers, school gardens, and neighborhood food initiatives. The alliance develops practical curricula, hosts training sessions, and evaluates outcomes to strengthen urban farming capacity and food system resilience. Its operations include working with institutions and neighborhood groups across North Texas to empower urban growers, increase local production, and enhance food literacy.","Web Link":"https://portal.nifa.usda.gov/web/crisprojectpages/1030931-north-texas-alliance-for-urban-agricultural-education.html","Comments":"A collaboration between Texas A&M Commerce, Skyline High School, Nimtiz High School, and CityLab High School."}]